{"artists":[{"id":271,"name":"ARCHIE ROACH","bio":"Archie Roach is best known as an award-winning singer and songwriter but he is also widely recognised as a campaigner for the rights of First Nations. On the back of his recent release, The Concert Collection 2012-2018, this spectacular memoir event will bring Roach’s extraordinary life story to all Australians and leave a lasting legacy for generations of future readers. Roach’s story is not only a lightning rod for the issues that we all face about our nation and the survival and optimism of First Nations Australians, but more importantly a powerful, passionate and moving personal story of music, family, love, loss and renewal.","url":"http://www.portfairyfolkfestival.com/archie-roach-2/","twitter":"","created_at":"2019-09-12T04:13:20.244Z","updated_at":"2019-09-12T04:13:20.244Z","image_file_name":"Archie_Roach_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":288266,"image_updated_at":"2019-09-12T04:13:19.898Z","artist_type":"musician"},{"id":273,"name":"BAND OF BROTHERS","bio":"Slava \u0026 Leonard Grigoryan are regarded as two of Australia’s finest classical guitarists, whilst Joseph Tawadros is a master of the oud, and his brother James has made a name for himself as a world-class percussionist specialising on the req, an Egyptian tambourine.  Performances by Band of Brothers are marked by group artistry of the highest order with repertoire that crosses cultural and stylistic barriers, from world music to jazz, classical and traditional. ","url":"http://","twitter":"","created_at":"2019-09-12T04:15:34.806Z","updated_at":"2019-09-12T04:15:34.806Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician"},{"id":274,"name":"BENNY WALKER","bio":"Capturing hearts with darker tracks reflecting a shadowy side such as those on album Through the Forest through to upbeat songs such as Summer Sun, Benny’s killer voice and songwriting talents have impressed audiences far and wide. Benny took home the gong for Best Aboriginal Act at The Age Music Victoria Music Awards in 2019 as well as being nominated for four NIMA awards in the same year. In 2017 Benny released hit single Ghost from his latest EP Undercover, both debuting at No.1 on the iTunes Blues chart.","url":"http://www.portfairyfolkfestival.com/benny-walker/","twitter":"","created_at":"2019-09-12T04:16:37.630Z","updated_at":"2019-09-12T04:16:37.630Z","image_file_name":"Benny_Walker_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":83083,"image_updated_at":"2019-09-12T04:16:37.343Z","artist_type":"musician"},{"id":276,"name":"CHITRA","bio":"Local singer songwriter Chitra seamlessly weaves the blunt force of rock n roll with the candid storytelling and heartache of country and soul.\r\nGrowing up amongst the rich music scene of the Bellarine Peninsula, Chitra found herself fully immersed with sounds both local and global and quickly developed a passion for songwriting. Chitra experiments with a variety of genres from folk to rhythm and blues, resulting in a robust vocal backed by jangly guitars and playful beats.\r\n","url":"http://www.portfairyfolkfestival.com/chitra/","twitter":"","created_at":"2019-09-12T04:18:54.350Z","updated_at":"2019-09-12T04:18:54.350Z","image_file_name":"Chitra_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":407623,"image_updated_at":"2019-09-12T04:18:54.064Z","artist_type":"musician"},{"id":277,"name":"CLAYMORE","bio":"Claymore’s reputation as outstanding entertainers has led them to perform at many local and international festivals including the Festival Interceltique in France – the largest Celtic festival in the world. With a mixture of traditional Scottish and Irish music and modern self-penned Celtic rock, the band represents the best of new age folk music. Through a diverse and unique mix of sounds featuring guitar, mandolin, fiddle, military snare, the highland bagpipes and even a didgeridoo, it is little wonder Claymore are one of Australia’s most popular festival acts and also a Port Fairy Folk Festival favourite. ","url":"http://","twitter":"","created_at":"2019-09-12T04:19:34.631Z","updated_at":"2019-09-12T04:19:34.631Z","image_file_name":"Claymore_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":266489,"image_updated_at":"2019-09-12T04:19:34.289Z","artist_type":"musician"},{"id":278,"name":"CÒIG – CAN","bio":"Còig’s music is a unique combination of influences that come from the four players: Darren McMullen, Rachel Davis, Jason Roach and Chrissy Crowley. Hot off the back of the release of their new album Ashlar, Còig comes to Port Fairy Folk Festival with their lively sets and tender traditional ballads through to fabulous covers – everything the band is known for – with a nod to the deep roots that inspired all four musicians to start playing Celtic music in the first place. Còig performs the best in traditional music, in a non-traditional way. ","url":"http://","twitter":"","created_at":"2019-09-12T04:21:43.710Z","updated_at":"2019-09-12T04:21:43.710Z","image_file_name":"Coig_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":258471,"image_updated_at":"2019-09-12T04:21:43.430Z","artist_type":"musician"},{"id":279,"name":"C.W. STONEKING","bio":"There are many strands to C.W. Stoneking’s music, he is often presented as a ‘blues artist,’ but the term disguises what makes his music special. A 1920s pre-war blues sound is key, with equal helpings of New Orleans jazz, jug band music, hokum, country and calypso, and he’s lately brought in elements of jump jive, early rock’n’roll and gospel. After charming audiences with acoustic guitars, national resonators, banjos and a band laden with brass on his first two albums, he dropped all of that to go electric with his latest album Gon’ Boogaloo (2014), which was all about his Fender Jazzmaster and doo-wop backing vocals. Not that he’s ditched his acoustic; his most recent tour was a solo affair: just him and his 1937 Epiphone Deluxe. His songs are irreverent and fantastical; his albums are full of humorous tales of talking animals, hoodoo gone wrong and a myriad of characters in unfortunate situations in locations from jail to the jungle to heaven itself. ","url":"http://www.portfairyfolkfestival.com/c-w-stoneking/","twitter":"","created_at":"2019-09-12T04:23:40.707Z","updated_at":"2019-09-12T04:23:40.707Z","image_file_name":"CW_Stoneking_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":395569,"image_updated_at":"2019-09-12T04:23:40.286Z","artist_type":"musician"},{"id":280,"name":"C.W. STONEKING","bio":"There are many strands to C.W. Stoneking’s music, he is often presented as a ‘blues artist,’ but the term disguises what makes his music special. A 1920s pre-war blues sound is key, with equal helpings of New Orleans jazz, jug band music, hokum, country and calypso, and he’s lately brought in elements of jump jive, early rock’n’roll and gospel. After charming audiences with acoustic guitars, national resonators, banjos and a band laden with brass on his first two albums, he dropped all of that to go electric with his latest album Gon’ Boogaloo (2014), which was all about his Fender Jazzmaster and doo-wop backing vocals. Not that he’s ditched his acoustic; his most recent tour was a solo affair: just him and his 1937 Epiphone Deluxe. His songs are irreverent and fantastical; his albums are full of humorous tales of talking animals, hoodoo gone wrong and a myriad of characters in unfortunate situations in locations from jail to the jungle to heaven itself. ","url":"http://www.portfairyfolkfestival.com/c-w-stoneking/","twitter":"","created_at":"2019-09-12T04:23:48.147Z","updated_at":"2019-09-12T04:23:48.147Z","image_file_name":"CW_Stoneking_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":395569,"image_updated_at":"2019-09-12T04:23:47.778Z","artist_type":"musician"},{"id":281,"name":"DANIEL CHAMPAGNE","bio":"Daniel Champagne exudes a natural ease on stage, as he sings poignant lyrics and beautifully crafted melodies that invariably whisk the heart up with grand romanticism. Exhilarating guitar talent that transcends mere acoustic playing to replicate a whole band. Champagne has toured and shared the stage with Tommy Emmanuel, Kaki King, Lucinda Williams, Judy Collins, John Butler, Ani DiFranco, Jake Shimabukuro, Rodrigo Y Gabriela, and Albert Lee. ","url":"http://","twitter":"","created_at":"2019-09-12T04:24:25.533Z","updated_at":"2019-09-12T04:24:25.533Z","image_file_name":"Daniel_Champagne_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":186451,"image_updated_at":"2019-09-12T04:24:25.262Z","artist_type":"musician"},{"id":282,"name":"DAN SULTAN","bio":"ARIA award-winning singer and songwriter Dan Sultan has been a singular musical presence in Australia since the release of his first album, Homemade Biscuits in 2006.\r\nFollowing on from the success of his 2018 EP, Killer Under a Blood Moon which saw Australian artists A.B. Original, Camp Cope, Meg Mac, and Gang of Youths frontman Dave Le’aupepe recreate works from his leading album Killer, Sultan has released his debut kids album, Nali \u0026 Friends, and in this special Port Fairy Folk Festival event he will be performing favourite music from across his career.\r\n","url":"http://www.portfairyfolkfestival.com/dan-sultan/","twitter":"","created_at":"2019-09-12T04:25:18.609Z","updated_at":"2019-09-12T04:25:18.609Z","image_file_name":"Dan_Sultan_1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":223542,"image_updated_at":"2019-09-12T04:25:18.358Z","artist_type":"musician"},{"id":284,"name":"EGO LEMOS - TIMOR LESTE","bio":"Musician, singer songwriter and environmental troubadour Ego Lemos is a remarkable man, with a remarkable voice in more ways than one. With three albums and an APRA-AMCOS Screen Award for the score for feature film Bilbao, Lemos tour across South America, Europe, Asia and Australia performing at festivals and solo concerts. On top of this, Lemos is a leading teacher in permaculture have co-authored Permaculture Gardens for Kids and working as Executive Director of Permatil. ","url":"http://www.portfairyfolkfestival.com/ego-lemos/","twitter":"","created_at":"2019-09-12T04:28:00.524Z","updated_at":"2019-09-12T04:28:00.524Z","image_file_name":"Ego_Lemos_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":344410,"image_updated_at":"2019-09-12T04:28:00.242Z","artist_type":"musician"},{"id":285,"name":"ELEANOR McEVOY - IRL","bio":"Eleanor McEvoy began her career as a session musician in Dublin, playing for numerous recordings and artists including U2, Sinead O’Connor and Mary Black. McEvoy was a violinist with the National Symphony Orchestra of Ireland for five years, but her real passion was song writing.  \r\nHer critically acclaimed canon of work spans fifteen albums and appearances on numerous compilation albums. She has also had numerous cover versions of her songs by performers such as Emmylou Harris, Mary Black, Phil Coulter, Mary Coughlan, Bella Hardy, Eliza Carthy, Derek Ryan, Jack L and up and coming Irish band Saint Sister. McEvoy’s latest album Forgotten Dreams (2019) was recorded in Air Studios in London as a direct-cut-to-vinyl.\r\n","url":"http://www.portfairyfolkfestival.com/eleanor-mcevoy/","twitter":"","created_at":"2019-09-12T04:29:04.384Z","updated_at":"2019-09-12T04:29:04.384Z","image_file_name":"Eleanor_McEvoy_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":263275,"image_updated_at":"2019-09-12T04:29:04.068Z","artist_type":"musician"},{"id":286,"name":"EMILY WURRAMARA  ","bio":"Brisbane-based emerging songwriter Emily Wurramara’s childhood was one of water and music. Growing up on Groote Eylandt in the Gulf of Carpentaria, days were filled with travel, fishing and extended family, a mother telling stories; seeds being sown for her future compositions. In 2018 Wurramara was nominated for an ARIA for Best Blues and Roots for her debut album Milyakburra, produced by David Bridie and which saw Wurramara singing in both her mother tongue Anindiyakwa and English.","url":"http://www.portfairyfolkfestival.com/emily-wurramara%E2%80%AF/","twitter":"","created_at":"2019-09-12T04:30:13.864Z","updated_at":"2019-09-12T04:30:13.864Z","image_file_name":"Emily_Wurramara_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":201414,"image_updated_at":"2019-09-12T04:30:13.551Z","artist_type":"musician"},{"id":287,"name":"FARA - SCO","bio":"At the forefront of contemporary Scottish folk, Orcadian quartet Fara make their Port Fairy Folk Festival debut with material from their second album, Times From Times Fall. Comprised entirely of self-penned songs and instrumentals, the young four-piece including Jennifer Austin, Kristan Harvey, Jeana Leslie and Catriona Price produce a spirited sound rooted in their remote homeland. Combining the unique Orkney fiddle tradition with contemporary songs and melodies, Fara celebrate the unity of their musical beginnings blending their four distinctively different musical voices together. Featuring words by Orcadian poets: George McKay Brown, Edwin Muir and Christina Costie; the images of Orkney running through these songs will evoke a sense of home and tradition.","url":"http://","twitter":"","created_at":"2019-09-12T04:30:59.431Z","updated_at":"2019-09-12T04:30:59.431Z","image_file_name":"Fara_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":294265,"image_updated_at":"2019-09-12T04:30:58.988Z","artist_type":"musician"},{"id":288,"name":"FIND YOUR VOICE ALL ABILITIES CHOIR","bio":"The Find Your Voice Choir is a celebration of human spirit. Established in southwest Victoria by singer/songwriter Tom Richardson and All Abilities Advocacy mentor Kylie Thulborn, the choir grew from humble grass-roots meetings into showcase performances at the 2018 Port Fairy Folk Festival. The choir features over 200 members from all corners of southwest Victoria and welcomes members of all abilities, ages, genders, ethnicities, sexual preferences, religions and backgrounds. Find Your Voice Choir continues to attract international attention prompting standing ovations and is one of the largest choir of its nature.","url":"http://www.portfairyfolkfestival.com/find-your-voice-all-abilities-choir-2/","twitter":"","created_at":"2019-09-12T04:32:13.971Z","updated_at":"2019-09-12T04:32:13.971Z","image_file_name":"FYV_choir2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":374639,"image_updated_at":"2019-09-12T04:32:13.654Z","artist_type":"musician"},{"id":289,"name":"FLATS \u0026 SHARPS - UK","bio":"Flats \u0026 Sharps are a high-energy contemporary Bluegrass band, from Penzance, Cornwall, in the South West of England, known for their own highly original songs as well as their blistering renditions of Bluegrass classics. These four incredible young musicians, Mikey Ponsford (mandolin, vocals), Josh Warner (guitar, vocals), Danny Hart (fiddle, banjo, vocals) and Liam Fitzharris (double bass, vocals), honed their skills in hundreds of live performances over the past eight years, charming and wowing audiences along the way. They've come a long way from their humble beginnings busking in Penzance as 17 year-olds, to performing at the Proms in Hyde Park, London, and at scores of festivals throughout the UK, Ireland, Europe, the US and Australia. ","url":"http://","twitter":"","created_at":"2019-09-12T04:33:03.005Z","updated_at":"2019-09-12T04:33:03.005Z","image_file_name":"Flats___Sharps_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":325578,"image_updated_at":"2019-09-12T04:33:02.585Z","artist_type":"musician"},{"id":290,"name":"GINA WILLIAMS \u0026 GUY GHOUSE","bio":"Gina Williams and Guy Ghouse have firmly established a reputation for bringing a fresh, modern take on ancient traditions; merging evocative sounds, natural acoustic instruments, poignant stories an incredible, beautiful voice. The natural rhythms of the Noongar language are perfectly captures and represented, and there’s an onstage connection and charisma that comes from two good friends who simply won’t quit. Williams has on four separate occasions taken out the WA Music Industry Award for Best Indigenous Artist. Telling her story and singing these beautiful crafted songs and often in her now rarely spoken language is deeply personal and something to share.\r\n","url":"http://www.portfairyfolkfestival.com/gina-williams-guy-ghouse/","twitter":"","created_at":"2019-09-12T04:33:56.720Z","updated_at":"2019-09-12T04:33:56.720Z","image_file_name":"Gina_Williams___Guy_Ghouse_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":286582,"image_updated_at":"2019-09-12T04:33:56.335Z","artist_type":"musician"},{"id":291,"name":"GRACE PETRIE - UK","bio":"Grace Petrie’s unique takes on life, love and politics, and the warmth and wit with which they are delivered, have won over an army of loyal fans across the alternative, folk, political and comedy scenes.  Petrie has toured with Frank Turner and Billy Bragg, supported comedians Robin Ince and Josie Long, and collaborated with Leon Rosselson and Peggy Seeger.  Petrie has been a frequent guest on BBC Radio 4’s the Now Show and has appeared on Channel 4’s Random Acts.  Petrie comes to Port Fairy Folk Festival following successful festival appearances at Vancouver Folk Festival, Latitude, Cambridge Folk Festival, and The Acoustic Stage at Glastonbury Festival. Her latest album, Queer As Folk (2018) was a Mojo magazine top 10 Folk Album of the Year","url":"http://","twitter":"","created_at":"2019-09-12T04:34:31.897Z","updated_at":"2019-09-12T04:34:31.897Z","image_file_name":"Grace-Petrie-photo-credit-David-Wilson-Clarke-13_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":188148,"image_updated_at":"2019-09-12T04:34:31.521Z","artist_type":"musician"},{"id":292,"name":"HUBERT FRANCIS – CAN","bio":"Hubert Francis was born and raised in Elsipogtog, an Indian Reservation in New Brunswick, Canada. He started his rock group J.Hubert Francis \u0026 Eagle Feather in 1990, with Eagle Feather becoming the first touring Aboriginal rock band in Canada. Releasing three albums, including the award-winning Message From a Drum in 1999, Francis and Eagle Feather have toured the world with their fusion of native chants and contemporary rock sounds. Hubert Francis and Eagle Feather have been nominated for numerous high profile awards including a Native American Music Award and two Juno nominations. Francis recently completed the filming of a documentary series, Eastern Tide, co-directing, performing and narrating in the Mi kmaq language.\r\n","url":"http://www.portfairyfolkfestival.com/hubert-francis/","twitter":"","created_at":"2019-09-12T04:35:28.479Z","updated_at":"2019-09-12T04:35:46.164Z","image_file_name":"Hubert_Francis_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":161176,"image_updated_at":"2019-09-12T04:35:28.085Z","artist_type":"musician"},{"id":293,"name":"IAN SHERWOOD - CAN","bio":"Armed with a saxophone, guitar, looping pedal and a voice that won him a Canadian Folk Music Award for Contemporary Singer of the Year, Ian Sherwood has charmed his way across the country and UK with his unique brand of genre-shifting music and stage show. A natural storyteller with a timeless sound, his influences are some of the best folk/pop/country singer-songwriters; from Bruce Springsteen to Tom Petty and Blue Rodeo. Named Best Male Artist by the International Acoustic Music Awards, twice named Musician of the Year by the Nova Scotia Music Awards. Sherwood has been called “a natural performer who entertains as much with his wit and stories as with his songs” – CBC Radio.","url":"http://","twitter":"","created_at":"2019-09-12T04:36:22.324Z","updated_at":"2019-09-12T04:36:22.324Z","image_file_name":"Ian_Sherwoood_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":309410,"image_updated_at":"2019-09-12T04:36:21.806Z","artist_type":"musician"},{"id":295,"name":"JOHN McCUTCHEON – USA","bio":"John McCutcheon has emerged as one of the most respected and loved folk/contemporary artists of the post-war generation. As an instrumentalist, he is a master of a dozen different traditional instruments, most notably the rare and beautiful hammer dulcimer. His song writing has been hailed by critics and singers around the globe, while his 35+ recordings have garnered every imaginable honour including six Grammy nominations. In his Port Fairy Folk Festival appearance, McCutcheon will perform songs by Pete Seeger from his tribute album plus favourites.","url":"http://www.portfairyfolkfestival.com/john-mccutcheon/","twitter":"","created_at":"2019-09-12T04:38:00.895Z","updated_at":"2019-09-12T04:38:00.895Z","image_file_name":"John_McCutcheon_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":352528,"image_updated_at":"2019-09-12T04:38:00.627Z","artist_type":"musician"},{"id":296,"name":"JOHN SMITH - UK ","bio":"With his honey-on-gravel voice and mesmerising fingerstyle guitar, John Smith has built a reputation as one of England’s finest guitarists and songwriters. Steeped in the lineage of British folk, taking his cue from Richard Thompson and John Martyn, Smith has evolved a transatlantic blend of fingerstyle and slide guitar techniques. Smith’s intimate take on love, loss and the journey we make, combined with his innovative guitar work, have won him a loyal following around the globe. 2019 saw the release of Smith’s fifth album Hummingbird. Prior to this Smith has played with, or opened for Davy Graham, John Martyn and John Renbourn, who dubbed him ”The future of folk music”.","url":"http://","twitter":"","created_at":"2019-09-12T04:38:37.535Z","updated_at":"2019-09-12T04:38:37.535Z","image_file_name":"John_Smith_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":358090,"image_updated_at":"2019-09-12T04:38:37.204Z","artist_type":"musician"},{"id":297,"name":"KIERAN KANE \u0026 RAYNA GELLERT - USA ","bio":"Kieran Kane and Rayna Gellert are the musical kindred spirits behind Kane Gellert. Kane’s seminal work in The O'Kanes and Kane Welch Kaplin, and as co-founder of independent label Dead Reckoning Records, laid the foundation for the contemporary world of Americana music. Kane has written songs for Alan Jackson, John Prine, Emmylou Harris and more as well as being a successful solo artist in his own right. Gellert turned to Appalachian old-time music at a young age, becoming a prodigious fiddler and leading a new revival of American string band music through her work with the acclaimed roots band Uncle Earl. Gellert has toured and recorded with artists such as Scott Miller, Abigail Washburn, Toubab Krewe and Robyn Hitchcock.  ","url":"http://www.portfairyfolkfestival.com/kieran-kane-rayna-gellert/","twitter":"","created_at":"2019-09-12T04:39:29.587Z","updated_at":"2019-09-12T04:39:29.587Z","image_file_name":"Kieran_Kane___Rayna_Gellert_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":368519,"image_updated_at":"2019-09-12T04:39:29.256Z","artist_type":"musician"},{"id":301,"name":"MĀMĀ MIHIRANGI \u0026 THE MĀREIKURA - NZ","bio":"New Zealand’s queen of live loops Māmā Mihirangi \u0026 the Māreikura take the stage by storm with a powerful show of stunning contemporary Māori music, dance, instruments, language, stories and costumes. Weaving ancient changes with intricate harmonies, traditional and contemporary instruments, beats and deep bass, the powerful and fierce all-female Māori world-roots production is led by internationally renowned artist and activist Māmā Mihirangi. Traditional female dancers, Māreikura perform alongside, presenting the virtues of feminine power and inspiring cultural identity with the women’s haka, traditional weaponry and Māori martial arts combined into a contemporary cultural performance.","url":"http://www.portfairyfolkfestival.com/mama-mihirangi-the-mareikura/","twitter":"","created_at":"2019-09-12T04:43:50.936Z","updated_at":"2019-09-12T04:43:50.936Z","image_file_name":"Māmā_Mihirangi___the_Māreikura_Small_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":302280,"image_updated_at":"2019-09-12T04:43:50.611Z","artist_type":"musician"},{"id":302,"name":"NEIL MURRAY","bio":"Maverick song man Neil Murray was a founding member of the Warumpi Band, which in the 1980s penetrated mainstream Australia with the iconic anthems My Island Home and Blackfella Whitefella. He has since become a respected singer/songwriter, releasing a string of remarkable albums. His latest are Blood and Longing and Tjungu with Sammy Butcher. Covered widely, Murray’s songwriting is diverse and his work has contributed to a deepening of Australian contemporary music. In 2017 Murray was names the Port Fairy Folk Festival Artist of the Year.","url":"http://","twitter":"","created_at":"2019-09-12T04:44:34.443Z","updated_at":"2019-09-12T04:44:34.443Z","image_file_name":"Neil_Murray_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":271010,"image_updated_at":"2019-09-12T04:44:34.106Z","artist_type":"musician"},{"id":304,"name":"ORIEL GLENNEN","bio":"Oriel Glennen is a folk singer/songwriter who hails from Port Fairy, the home of our Folk Festival. Over the last 15 years, she has performed at various venues and festivals; both nationally and internationally. Her Celtic Cornish heritage and her connection to place is strong through the musical imagery she creates with songs rich in sea tale and folklore and songs that reach out and connect the emotional heart of a song to that of her audience. Oriel is accompanied this year by the outstanding talents of both Kate Garrison on cello and Anna Batson (UK) on keyboard.  ","url":"http://","twitter":"","created_at":"2019-09-12T04:45:51.818Z","updated_at":"2019-09-12T04:45:51.818Z","image_file_name":"Oriel_Glennnen_1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":201900,"image_updated_at":"2019-09-12T04:45:51.545Z","artist_type":"musician"},{"id":305,"name":"PATTY GRIFFIN – USA","bio":"Patty Griffin is among the most consequential singer-song writers of her generation, a quintessentially American artist whose wide-ranging canon incisively explores the intimate moments and universal emotions that bind us together. Griffin has had her work performed by a truly epic assortment of her fellow artists including Linda Ronstadt, Emmylou Harris, Dixie Chicks, Kelly Clarkson and Jeff Beck to name but a few. Over the course of two decades, the Grammy® Award-winner – and seven-time nominee – has crafted nine classic studio albums and two live collections. Patty Griffin’s new self-titled album represents an extraordinary new chapter for this incomparable musician. \r\n","url":"http://www.portfairyfolkfestival.com/patty-griffin/","twitter":"","created_at":"2019-09-12T04:47:08.809Z","updated_at":"2019-09-12T04:47:08.809Z","image_file_name":"Patty_Griffin_Michael_Wilson_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":309728,"image_updated_at":"2019-09-12T04:47:08.467Z","artist_type":"musician"},{"id":306,"name":"PAUL MCKENNA TRIO - SCO ","bio":"Labelled as “the best folk band to have come out of Scotland in the last twenty years” by the New York Times, award-winning Glasgow singer Paul McKenna is ranked among Scotland’s finest young songwriters, armed with a powerful yet intensely emotive voice and passionate social conscience. Alongside Conor Markey (banjo, bouzouki, guitars) and Ewan Baird (percussion), Paul McKenna draws on both Scottish and Irish roots in a dynamic full-bodied array of original and traditional material. ","url":"http://","twitter":"","created_at":"2019-09-12T04:47:49.228Z","updated_at":"2019-09-12T04:47:49.228Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician"},{"id":307,"name":"RUBY GILL","bio":"Ruby Gill is leaving permanent potholes in the status quo left by the likes of Joni Mitchell, Glen Hansard and Regina Spektor with career-defining grit, overwhelming honesty and unique insight into the worlds of bird, border security and panic attacks. Off the back of a sold-out tour of South Africa, the songwriter unleashed her gritty debut single Your Mum in 2018 which received rave reviews across the globe. Ruby’s immense voice, heavy piano and vulnerable stage presence have been appearing on festivals around the world from Oppikoppi to Woodford. ","url":"http://www.portfairyfolkfestival.com/ruby-gill/","twitter":"","created_at":"2019-09-12T04:48:49.541Z","updated_at":"2019-09-12T04:48:49.541Z","image_file_name":"Ruby_Gill_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":403055,"image_updated_at":"2019-09-12T04:48:49.246Z","artist_type":"musician"},{"id":308,"name":"SAIJE","bio":"From Bellingen, NSW, Saije is a multi-instrumental folk pop duo whose soulful voices and transporting guitar interweaves their stories through a blend of harmony and rhythmic strength. The duo’s song writing encourages connection to self, the earth and to each other, inviting audiences on a journey from the depths of ancient forests to bustling French markets, weaving threads of Celtic and French gypsy flavours into their folk tunes along the way. Having toured Europe extensively, Saije recorded and released their second EP Without Walls, and have dazzled audiences at a number of Australia’s festival gems including the Mullumbimby and Cygnet Folk Festivals. In 2019 the duo received the Folk Alliance Australia Young Artist of the Year Award at the National Folk Festival.  ","url":"http://","twitter":"","created_at":"2019-09-12T04:49:27.231Z","updated_at":"2019-09-12T04:49:27.231Z","image_file_name":"Saije_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":210703,"image_updated_at":"2019-09-12T04:49:26.948Z","artist_type":"musician"},{"id":312,"name":"STARTIJENN – FRA","bio":"Startijenn draws the necessary energy out of its roots to create a powerful, efficient and contemporary sound. Established in 1997 when the founding members were just 13 years old, Startijenn now includes five musicians who fuse traditional instruments with a contemporary rhythmic section offering very lively Breton music through original compositions. After five award-winning studio albums, the group continue to surprise audiences with their unique music drawing from Arabic trance and Breton influences. Rich from musical experiences and from 20 years of touring together, Startijenn is a true world music group.","url":"http://","twitter":"","created_at":"2019-09-12T04:55:12.405Z","updated_at":"2019-09-12T04:55:12.405Z","image_file_name":"Startijenn_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":285337,"image_updated_at":"2019-09-12T04:55:11.923Z","artist_type":"musician"},{"id":313,"name":"SUSAN O’NEILL - IRL","bio":"All the way from Co. Clare, Ireland, the prodigiously gifted Susan O’Neill’s soulful and husky-voiced performances are truly something to behold. With a striking attitude, guitar, harmonica, trumpet and loop pedal, Susan delivers a timeless and powerful blend of the old soul with a new edge.  Described as a ‘ballsier Adele’ by Hotpress magazine and tipped as the traces of Janis Joplin reincarnate, from an early age Susan has picked up many fans including U2’s Bono after covering their Exit song for the 30th anniversary celebration of The Joshua Tree.The incredible range of Susan’s gritty vocal and emotionally charged approach make for a truly unforgettable musical experience.\r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:55:55.218Z","updated_at":"2019-09-12T04:55:55.218Z","image_file_name":"SON_-_001_(1)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":211357,"image_updated_at":"2019-09-12T04:55:54.931Z","artist_type":"musician"},{"id":272,"name":"THE BLIND BOYS OF ALABAMA - USA","bio":"The Blind Boys of Alabama are recognised worldwide as living legends of gospel music. With a career spanning over 70 years, The Blind Boys are known for crossing multiple musical boundaries with their remarkable interpretations of everything from traditional gospel favourites to contemporary spiritual material by songwriters such as Eric Clapton, Prince and Tom Waits. Winners of five Grammy® Awards, The Blind Boys have appeared on recordings with a huge list of artists including Lou Reed, Aaron Neville, Willie Neson, Bonnie Raitt, Ben Harper, Patty Griffin and Taj Mahal.","url":"http://www.portfairyfolkfestival.com/the-blind-boys-of-alabama/","twitter":"","created_at":"2019-09-12T04:14:58.669Z","updated_at":"2019-09-12T04:14:58.669Z","image_file_name":"BBdoorColor_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":356656,"image_updated_at":"2019-09-12T04:14:58.382Z","artist_type":"musician"},{"id":275,"name":"THE BURNING HELL - CAN","bio":"In 2007, Canadian songwriter Mathias Kom quit teaching history and started a band called The Burning Hell after a religious tract, handed to him by a wide-eyed zealot in Toronto. Mathias subsequently invited all of his friends to join him in performing his songs about seagulls, shopping malls, conferences, and the similarities between love and hurricanes. Over the next 10 years and almost as many albums, the line-up and sound of The Burning Hell have changed often, but the band has remained idiosyncratic and unclassifiable – much to the delight of those who love them. The constant has always remained Kom’s singular outlook on the world: wise and naïve, cynical and life-affirming, full of brilliant, unexpected narratives and a deeply felt generosity of spirit. The band’s live performances underscore these themes; they exhibit a joy and camaraderie too infrequently seen on stage. Indeed, the essence of the band is inclusive and celebratory; there’s something for everyone.","url":"http://","twitter":"","created_at":"2019-09-12T04:17:11.224Z","updated_at":"2019-09-12T04:17:46.008Z","image_file_name":"The_Burning_Hell_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":320136,"image_updated_at":"2019-09-12T04:17:45.731Z","artist_type":"musician"},{"id":283,"name":"THE EAST POINTERS – CAN","bio":"Award-winning Canadian trio The East Pointers - Tim Chaisson, Koady Chaisson and Jake Charron - have redefined the ever-evolving genre of modern folk with their third album Yours To Break released in 2019. With Billboard-worthy pop hooks, deep acoustic groove, trance-like trad breakdowns and three-part harmonies, the internationally acknowledged musical trailblazers have set a path for a new generation of music lovers.","url":"http://www.portfairyfolkfestival.com/the-east-pointers/","twitter":"","created_at":"2019-09-12T04:26:28.987Z","updated_at":"2019-09-12T04:26:28.987Z","image_file_name":"The_East_Pointers_2019_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":381662,"image_updated_at":"2019-09-12T04:26:28.696Z","artist_type":"musician"},{"id":294,"name":"THE JELLYMAN’S DAUGHTER - SCO","bio":"Scottish duo The Jellyman's Daughter lands squarely in the middle of an intriguing crossroads between bluegrass, post-rock, folk and soul. Mixing their unique vocal harmonies with wild and visceral cello, driving guitar and sweet mandolin, Emily Kelly and Graham Coe write their songs together with a focus on doing something new. In 2018 The Jellyman’s Daughter released their new album, Dead Reckoning, representing a marked step forward in maturity, depth and scope for the duo, achieving five stars in multiple publications and inclusion in Popmatters’ the 20 Best Folk Albums of 2018. \r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:37:08.168Z","updated_at":"2019-09-12T04:37:08.168Z","image_file_name":"The_Jellymans_Daughter_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":254016,"image_updated_at":"2019-09-12T04:37:07.874Z","artist_type":"musician"},{"id":298,"name":"THE LANGAN BAND - SCO","bio":"Offering sounds emerging from Celtic, gypsy swing, Roma and flamenco, Britain’s The Langan Band are a high energy three piece act taking traditional acoustic idioms and delivering with punk abandonment and virtuosic flare.Lead by front man and percussionist John Langan, the group swerves between the fiddle and bass, the rhythm guitar, Cajon and tambourine in an eerie, psychedelic and mesmerising performance that challenges the limitations of what people might expect acoustic instruments to sound like.\r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:41:01.244Z","updated_at":"2019-09-12T04:41:01.244Z","image_file_name":"Langan_Band_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":293514,"image_updated_at":"2019-09-12T04:41:00.752Z","artist_type":"musician"},{"id":299,"name":"THE LITTLE STEVIES","bio":"The Little Stevies have existed as a band for many years and have taken on many incarnations. At the heart of the band are sisters Bethany and Sibylla Stephen who have an uncanny knack of captivating an audience by being delightfully and unapologetically themselves. The Little Stevies are well known around the Australian festival circuit for their fun loving between-song banter and storytelling of everyday life. With a deep, full and warmly polished sound, sweet layered harmonies and irresistible melodies, the sisters’ music tends to leave a lasting impression.","url":"http://www.portfairyfolkfestival.com/the-little-stevies/","twitter":"","created_at":"2019-09-12T04:41:56.152Z","updated_at":"2019-09-12T04:41:56.152Z","image_file_name":"The_Little_Stevies_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":313768,"image_updated_at":"2019-09-12T04:41:55.814Z","artist_type":"musician"},{"id":300,"name":"THE MAES ","bio":"Multi-award-winning Melbourne contemporary folk outfit, The Maes is the brainchild of sisters Maggie and Elsie Rigby. Their latest, self-titled record released in 2019 is a return to the sisters’ folk music roots and follows on from the success of their Take Care Take Cover (2017) and live performances at festivals all over the world. Gentle, intimate and conversational, the new album is an unadorned showcase of Maggie and Elsie’s superb songwriting as well as honest, relaxed and stunning vocal and instrumental performances.  ","url":"http://www.portfairyfolkfestival.com/the-maes/","twitter":"","created_at":"2019-09-12T04:42:51.830Z","updated_at":"2019-09-12T04:42:51.830Z","image_file_name":"The_Maes_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":350783,"image_updated_at":"2019-09-12T04:42:51.476Z","artist_type":"musician"},{"id":309,"name":"THE SANDMAN \u0026 FLACCO TRIBUTE SHOW  ","bio":"Sandman \u0026 Flacco: these two fictional characters passed away quietly, without fuss, ten years ago. Both were struck down with a deadly affliction known as “Irrelevance.”  \r\n In 2020 Steve “The Sandman” Abbott \u0026 Paul “Flacco” Livingston return to the stage for at least sixty minutes to present songs of The Sandman, soliloquies of suburban subsistence and monologues of morose musings. Hear Steve reading Sandman and Paul reading Flacco. Apart from exhuming their alter egos of the 80’s and 90’s, Paul and Steve will startle audiences with their sublimely adequate musical talents. This will be an hour you will never get back.  \r\nNote: Please be gentle with the performers – no one wants to die at their own funeral… \r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:50:38.954Z","updated_at":"2019-09-12T04:50:38.954Z","image_file_name":"Sandman___Flacco__1200x800.jpg","image_content_type":"image/jpeg","image_file_size":382602,"image_updated_at":"2019-09-12T04:50:38.603Z","artist_type":"musician"},{"id":310,"name":"THE SMALL GLORIES – CAN","bio":"Roots duo The Small Glories are Cara Luft \u0026 JD Edwards, a musical tour-de-force partnership planted on the Canadian Prairies. With a stage banter striking a unique balance between slapstick and sermon, these veteran singer/songwriters have a way of making time disappear. The Small Glories create a soundscape amplified by pounding drums and other textural embellishments which only reinforce the magic of their innate chemistry. Luft and Edwards duplicate and reinforce each other’s strengths on the stage which is made clear in their latest album Assiniboine \u0026 The Red, resulting in a live show that is as heartwarming as it is hilarious.","url":"http://www.portfairyfolkfestival.com/the-small-glories/","twitter":"","created_at":"2019-09-12T04:53:40.287Z","updated_at":"2019-09-12T04:53:40.287Z","image_file_name":"The_Small_Glories_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":394805,"image_updated_at":"2019-09-12T04:53:39.933Z","artist_type":"musician"},{"id":311,"name":"THE SOUTHERN OCEAN SEA BAND ","bio":"The Southern Ocean Sea Band hail from Port Fairy town and have grown up with the Festival. The 9-piece line-up will take you on a journey into local stories and legends. \r\n The Southern Ocean Sea Band were borne directly from the late Danny Spooner’s Shanties at the River sessions, and a resultant flurry of writing and production activity towards their epic debut album Blood \u0026 Bones \u0026 Fins \u0026 Glory (2017). Following on from this epic release, the band have toured regional Victoria, spreading their historical songs and shanty love far and wide. They cite The Fairytale of Port Fairy event in 2018 as a career highlight, performing three songs and backing up Steve Poltz and Rebecca Barnard singing The Fairytale of New York. \r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:54:31.333Z","updated_at":"2019-09-12T04:54:31.333Z","image_file_name":"Southern_Ocean_Sea_Band_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":406000,"image_updated_at":"2019-09-12T04:54:30.951Z","artist_type":"musician"},{"id":314,"name":"THINGS OF STONE \u0026 WOOD","bio":"Thirty years ago a rag-tag bunch of folkies got together and formed a band called Things of Stone \u0026 Wood that went on to define Melbourne in the early 1990s. Off the back of their top 10 single Happy Birthday Helen, the band achieved national success, international tours, a gold album The Yearning and even a Late Show television parody, kicking off a career that would place them as one of Australia's most loved folk-rock bands. The group’s imaginative use of organic instruments set off an acoustic/folk movement that paved the way for the likes of John Butler, The Waifs and Angus \u0026 Julia Stone. Their live performances have always been full of energy and passion and whilst they've won many an industry award, it’s on stage that demonstrates why they're so loved. The band return to Port Fairy for their 30th anniversary tour launching their first album in over a decade.  \r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:56:52.011Z","updated_at":"2019-09-12T04:56:52.011Z","image_file_name":"Things_of_Stone___Wood_(TOSAW)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":392773,"image_updated_at":"2019-09-12T04:56:51.699Z","artist_type":"musician"},{"id":315,"name":"THIS WAY NORTH","bio":"It’s easy to forget that This Way North is a two-piece band. With Cat Leahy on drums and Leisha Jungalwalla wailing on her electric guitar, the duo create a uniquely full, expansive sound that leaves the audience stunned. Currently of no fixed address, Cat and Leisha are enjoying making a home for themselves on the road and the stage. Whether in a local dive bar or at a national festival, This Way North bring more passion and energy than a 10-piece band, drumming up a contagious euphoria. The past two years have been huge for the duo, since they made the decision to concentrate on playing music full time they have added over 200 live shows across Australia, New Zealand and Canada to their ever-expanding resume. This Way North have brought their magic to audiences from the Yukon to Iqaluit, Nunavut to Haida Gwaii, across Australia's sweeping central desert and down to the geysers of Rotorua New Zealand.  This Way North invite you to turn up the volume and let loose. \r\n","url":"http://","twitter":"","created_at":"2019-09-12T04:57:38.781Z","updated_at":"2019-09-12T04:57:38.781Z","image_file_name":"This_Way_North_K.Atkinson_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":191102,"image_updated_at":"2019-09-12T04:57:38.348Z","artist_type":"musician"},{"id":316,"name":"TONY McMANUS - CAN","bio":"Tony McManus is acknowledged as one of the leading Celtic guitarists in the world and has just been listed as one of the 50 transcendental guitarists of all time by Guitar Player Magazine. Ranked by peers and predecessors alike alongside the guitar world’s all-time greats, his fiendishly dexterous, dazzlingly original playing draws on traditions from the entire Celtic diaspora, along with still further-ranging flavours, such as jazz and east European music. Long applauded for his uncanny ability to transpose the delicate, complex ornamentation characteristic of traditional bagpipe or fiddle tunes – even the phrasing of a Gaelic song – onto his own six strings, McManus is increasingly being referenced as a pioneering figure in bridging the realms of Celtic music and other guitar genres. ","url":"http://","twitter":"","created_at":"2019-09-12T04:58:11.694Z","updated_at":"2019-09-12T04:58:11.694Z","image_file_name":"TonyMcManus3.1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":260648,"image_updated_at":"2019-09-12T04:58:11.354Z","artist_type":"musician"},{"id":317,"name":"UPTOWN BROWN  ","bio":"'Uptown' Brown! is a singing gentleman-adventurer performing a program of primitive 1920s and 1930s jazz and blues on a self-invented one man band. His musical contraption is built from cedar, leather and brass, whilst vocals and fingerpicked ukulele are amplified through old megaphones, mimicking the effect of a 78 record. A quality musical and roving act in the finest tradition of vaudeville and ragtime. ","url":"http://","twitter":"","created_at":"2019-09-12T04:58:44.968Z","updated_at":"2019-09-12T04:58:44.968Z","image_file_name":"Uptown_Brown_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":276772,"image_updated_at":"2019-09-12T04:58:44.658Z","artist_type":"musician"},{"id":318,"name":"WILLIAM CRIGHTON","bio":"Combining traditional music with unexpected experimentation William Crighton is highly acclaimed across the globe from sell out tours and festival appearances in his homeland of Australia including Blues Fest, WOMAD and Woodford Folk Festival, to appearances at the Cambridge Folk Festival, Boomtown in the UK, and Tonder in Denmark, as well as sell out shows in the UK and Scandinavia and tours in the US and Canada. Crighton grew up in the Riverina, a sparsely populated region of NSW (Wiradjuri Nation) Australia. He has released two studio albums and one live album. He identifies powerful analogues of lived experience, through his visceral and poetic music with shades of psychedelia. His landmark second album Empire was hailed as The Album of the Year 2018 by The Saturday Paper.\r\n","url":"http://www.portfairyfolkfestival.com/william-crighton/","twitter":"","created_at":"2019-09-12T04:59:19.806Z","updated_at":"2019-09-12T05:03:22.702Z","image_file_name":"WILLIAM_CRIGHTON_2019_high_res_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":237571,"image_updated_at":"2019-09-12T04:59:19.452Z","artist_type":"musician"},{"id":319,"name":"WILL KIMBROUGH - USA","bio":"Alabama native, Nashville resident Will Kimbrough is deeply rooted in the old school sounds of country, gospel, traditional blues, American folk and roots music.\r\nKimbrough last graced our shores playing guitar with Emmylou Harris’ Red Dirt touring band. The award-winning singer and songwriter was named as the Americana Music Association Instrumentalist of the Year in 2004, and this success is reflected by the demands on his time as a session player, record producer and touring musician.\r\nKimbrough’s latest record production credits are albums for Steve Poltz and Rodney Crowell. In 2019 Kimbrough released his ninth solo recording, I Like It Down Here and he will perform works from this album and across his career at the Port Fairy Folk Festival.\r\n","url":"http://","twitter":"","created_at":"2019-09-12T05:00:02.640Z","updated_at":"2019-09-12T05:00:02.640Z","image_file_name":"Will_Kimbrough_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":414675,"image_updated_at":"2019-09-12T05:00:02.345Z","artist_type":"musician"},{"id":321,"name":"YE VAGABONDS - IRL","bio":"The brothers behind Ireland’s Ye Vagabond, Brían and Diarmuid Mac Gloinn grew up playing music together around their hometown of Carlow, a small town in the southeast of Ireland. After moving to Dublin in 2012, they quickly became a staple of the country’s live music and session scene, playing their own original songs as well as folk songs from Ireland, Scotland, England and America. After performing with Glen Harsard at Electric Picnic in 2015, the brothers continued to tour Ireland, the UK and Europe performing with Villagers, Roy Harper and Lisa Hannigan. They have performed sold out headline shows in Ireland, France, Switzerland and the UK. In 2017 they launched their debut, self-titled album to great acclaim comprising harmony and rich folk music, as well as influenced by Irish traditional music, Appalachian singing, and the 1960's folk revival. Ye Vagabonds second album The Hare’s Lament was released in 2019 to great acclaim.","url":"http://","twitter":"","created_at":"2019-09-12T05:01:43.592Z","updated_at":"2019-09-12T05:01:43.592Z","image_file_name":"Ye_Vagabonds_(preferred)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":274417,"image_updated_at":"2019-09-12T05:01:43.115Z","artist_type":"musician"},{"id":320,"name":"YID!","bio":"YID! is a 22-piece ensemble performing European Jewish folk songs through a 21st century filter. Effortlessly amalgamating klezmer, funk, big band, indie-folk and electronic dance into a wild, immersive, theatrical experience, YID!’s charter is to reinvent the old and amazing culture and bring it into the here and now. YID!’s multi-sensory performance combines Yiddish language, group improvisation, song and poetry and with some of the most respected musicians in the Australian music scene making up the incredible ensemble, audiences are in for a zany fusion of Yiddish drinking songs and feisty free-jazz exclamations.","url":"http://www.portfairyfolkfestival.com/yid/","twitter":"","created_at":"2019-09-12T05:01:00.687Z","updated_at":"2019-09-12T05:01:00.687Z","image_file_name":"YID_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":560542,"image_updated_at":"2019-09-12T05:01:00.377Z","artist_type":"musician"},{"id":322,"name":"YOLANDA BROWN - UK","bio":"Charismatic and charming, YolanDa Brown is the premier female saxophonist in the UK. An award-winning saxophonist, Brown has made the instrument truly her own with her fusion of reggae, jazz and soul.Brown was the first musician to win a MOBO Award for Best Jazz across two consecutive years.Having toured with Diana Krall, The Temptations, Billy Ocean, Jools Holland’s Rhythm and Blues Orchestra and collaborated with artists such as Snarky Puppy’s Bill Laurance and Julian Marley, it’s no wonder Brown’s albums have received critical acclaim, with both hitting no.1 spot on the UK charts. Outside of touring and recording, Brown presents YolandDa’s Band Jam a music show for children’s television. \r\n","url":"http://www.portfairyfolkfestival.com/yolanda-brown-2/","twitter":"","created_at":"2019-09-12T05:02:46.838Z","updated_at":"2019-09-12T05:02:46.838Z","image_file_name":"YolanDa_Brown_Photo_by_Agenda_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":204183,"image_updated_at":"2019-09-12T05:02:46.597Z","artist_type":"musician"}],"venues":[{"id":89,"name":"Festival Arena","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:21.193Z","updated_at":"2016-02-29T00:35:21.193Z","gig_id":null},{"id":84,"name":"Fiddlers Green","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.975Z","updated_at":"2016-02-29T00:35:19.975Z","gig_id":null},{"id":88,"name":"Flag Circle","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.949Z","updated_at":"2016-02-29T00:35:20.949Z","gig_id":null},{"id":92,"name":"Folk Circus Area","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:21.922Z","updated_at":"2016-02-29T00:35:21.922Z","gig_id":null},{"id":91,"name":"Folk Circus Floor","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:21.679Z","updated_at":"2016-02-29T00:35:21.679Z","gig_id":null},{"id":90,"name":"Folk Circus Stage","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:21.436Z","updated_at":"2016-02-29T00:35:21.436Z","gig_id":null},{"id":83,"name":"FOLKworX","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.731Z","updated_at":"2016-02-29T00:35:19.731Z","gig_id":null},{"id":93,"name":"Lecture Hall","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:22.165Z","updated_at":"2016-02-29T00:35:22.165Z","gig_id":null},{"id":98,"name":"Lighthouse","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:23.380Z","updated_at":"2016-02-29T00:35:23.380Z","gig_id":null},{"id":103,"name":"Lighthouse Cafe","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:24.597Z","updated_at":"2016-02-29T00:35:24.597Z","gig_id":null},{"id":99,"name":"Moyneyana House","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:23.623Z","updated_at":"2016-02-29T00:35:23.623Z","gig_id":null},{"id":100,"name":"Parade Route","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:23.867Z","updated_at":"2016-02-29T00:35:23.867Z","gig_id":null},{"id":85,"name":"Railway Stage","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.219Z","updated_at":"2016-02-29T00:35:20.219Z","gig_id":null},{"id":86,"name":"Reardon Theatre","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.462Z","updated_at":"2016-02-29T00:35:20.462Z","gig_id":null},{"id":96,"name":"RSL Hall","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:22.894Z","updated_at":"2016-02-29T00:35:22.894Z","gig_id":null},{"id":95,"name":"School Hall","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:22.651Z","updated_at":"2016-02-29T00:35:22.651Z","gig_id":null},{"id":82,"name":"Shebeen","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.488Z","updated_at":"2016-02-29T00:35:19.488Z","gig_id":null},{"id":76,"name":"Stage 1","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.024Z","updated_at":"2016-02-29T00:35:18.024Z","gig_id":null},{"id":77,"name":"Stage 2","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.270Z","updated_at":"2016-02-29T00:35:18.270Z","gig_id":null},{"id":78,"name":"Stage 3","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.514Z","updated_at":"2016-02-29T00:35:18.514Z","gig_id":null},{"id":79,"name":"Stage 4","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.757Z","updated_at":"2016-02-29T00:35:18.757Z","gig_id":null},{"id":80,"name":"Stage 5","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.001Z","updated_at":"2016-02-29T00:35:19.001Z","gig_id":null},{"id":81,"name":"Stage 6","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.244Z","updated_at":"2016-02-29T00:35:19.244Z","gig_id":null},{"id":94,"name":"St Johns Church","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:22.408Z","updated_at":"2016-02-29T00:35:22.408Z","gig_id":null},{"id":87,"name":"St Pats Hall","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.706Z","updated_at":"2016-02-29T00:35:20.706Z","gig_id":null},{"id":97,"name":"Surf Club","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:23.137Z","updated_at":"2016-02-29T00:35:23.137Z","gig_id":null},{"id":101,"name":"The Shebeen","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:24.110Z","updated_at":"2016-02-29T00:35:24.110Z","gig_id":null},{"id":102,"name":"The Wharf","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:24.353Z","updated_at":"2016-02-29T00:35:24.353Z","gig_id":null}],"gigs":[{"id":416,"name":"","starttime":"2015-03-07T10:30:00.000Z","endtime":"2015-03-07T11:15:00.000Z","created_at":"2019-07-08T12:36:26.056Z","updated_at":"2019-07-08T12:36:58.424Z","venue_id":76},{"id":417,"name":"","starttime":"2015-03-07T14:00:00.000Z","endtime":"2015-03-07T15:00:00.000Z","created_at":"2019-07-08T12:37:38.817Z","updated_at":"2019-07-08T12:38:03.399Z","venue_id":77},{"id":415,"name":"","starttime":"2015-03-07T17:30:00.000Z","endtime":"2015-03-07T18:15:00.000Z","created_at":"2019-07-08T12:35:39.681Z","updated_at":"2019-07-08T12:38:10.397Z","venue_id":76}]}