{"artists":[{"id":325,"name":"Alana Wilkinson","bio":"Described as equal parts vulnerable folk singer and vitriolic poet, Alana Wilkinson has turned heads recently with stellar performances across major festivals such as Blue Mountains, Queenscliff, Woodford and Nannup. Equally at home in the intimate confines of a house concert or in the expansive surrounds of a festival, Wilkinson engages audiences with revealing and hilarious stories and songs that leave you pondering the joys of life with a smile on your dial.","url":"https://www.portfairyfolkfestival.com/alana-wilkinson/","twitter":"","created_at":"2020-01-06T01:35:48.314Z","updated_at":"2020-01-07T10:54:24.661Z","image_file_name":"image_(1).png","image_content_type":"image/png","image_file_size":350759,"image_updated_at":"2020-01-07T10:54:24.142Z","artist_type":"musician","country":"AUS"},{"id":326,"name":"Aloha Baby","bio":"Australia’s premiere Hapa Haole band Aloha Baby will whisk you away to the land of a million flowers, where trade winds sigh in the heavens. Ukulele, lap steel, double bass and three part harmonies create a beautiful Island ambience with instrumentals and upbeat kitsch Hapa Haole tunes, while stunning hula maidens tell the story of the songs in dance. Aloha Baby have appeared at a number of festivals and presented their own luau shows since 2006.","url":"https://www.portfairyfolkfestival.com/aloha-baby/","twitter":"","created_at":"2020-01-06T01:36:04.610Z","updated_at":"2020-01-06T03:18:39.054Z","image_file_name":"Aloha_Baby_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":395008,"image_updated_at":"2020-01-06T03:18:38.584Z","artist_type":"musician","country":"AUS"},{"id":324,"name":"Amistat","bio":"Twin brothers Josef and Jan Prasil were born in Germany and raised in Italy, eventually moving to Australia to propel their music career. Finding themselves in the soundscape of a modern Simon and Garfunkel with influences from the likes of Ben Howard, Kings of Convenience and Kodaline, Amistat are definitely best enjoyed live. Josef and Jan produce a unique synergy through the use of tight knit harmonies, shaped by an honest, storytelling vocal tone. They perform in Port Fairy following their European and UK tour in 2019, celebrating the release of their latest album Love and Light.","url":"https://www.portfairyfolkfestival.com/amistat-2/","twitter":"","created_at":"2020-01-06T01:35:30.316Z","updated_at":"2020-01-06T03:19:35.669Z","image_file_name":"Amistat-Band-Jan-_-Josef_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":279193,"image_updated_at":"2020-01-06T03:19:35.154Z","artist_type":"musician","country":"AUS"},{"id":388,"name":"Angela Williams","bio":"","url":"http://","twitter":"","created_at":"2020-01-16T01:25:12.004Z","updated_at":"2020-01-16T01:25:12.004Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":271,"name":"Archie Roach","bio":"Archie Roach is best known as an award-winning singer and songwriter but he is also widely recognised as a campaigner for the rights of First Nations. On the back of his recent release, The Concert Collection 2012-2018, this spectacular memoir event will bring Roach’s extraordinary life story to all Australians and leave a lasting legacy for generations of future readers. Roach’s story is not only a lightning rod for the issues that we all face about our nation and the survival and optimism of First Nations Australians, but more importantly a powerful, passionate and moving personal story of music, family, love, loss and renewal.","url":"https://www.portfairyfolkfestival.com/archie-roach-2/","twitter":"","created_at":"2019-09-12T04:13:20.244Z","updated_at":"2020-01-06T03:21:02.545Z","image_file_name":"Archie_Roach_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":288266,"image_updated_at":"2020-01-06T03:21:02.209Z","artist_type":"musician","country":"AUS"},{"id":273,"name":"Band Of Brothers","bio":"Slava \u0026 Leonard Grigoryan are regarded as two of Australia’s finest classical guitarists, whilst Joseph Tawadros is a master of the oud, and his brother James has made a name for himself as a world-class percussionist specialising on the req, an Egyptian tambourine.  Performances by Band of Brothers are marked by group artistry of the highest order with repertoire that crosses cultural and stylistic barriers, from world music to jazz, classical and traditional. ","url":"https://www.portfairyfolkfestival.com/band-of-brothers/","twitter":"","created_at":"2019-09-12T04:15:34.806Z","updated_at":"2020-01-06T03:23:44.618Z","image_file_name":"BandOfBrothers_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":270401,"image_updated_at":"2020-01-06T03:23:44.256Z","artist_type":"musician","country":"AUS"},{"id":329,"name":"Benny B","bio":"Originally an electrical engineer, Ben Bryant decided to follow his dreams and run away to the circus. Now with more than 10 years professional experience, Ben Bryant is one of Australia’s most creative and innovative comic circus performers. His ability to combine graceful movement, high level circus skills and absurd humour with ease makes him a truly unique performer.","url":"https://www.portfairyfolkfestival.com/benny-b-2/","twitter":"","created_at":"2020-01-06T01:36:58.045Z","updated_at":"2020-01-06T03:24:36.705Z","image_file_name":"BennyB_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":327621,"image_updated_at":"2020-01-06T03:24:36.340Z","artist_type":"musician","country":"AUS"},{"id":274,"name":"Benny Walker","bio":"Capturing hearts with darker tracks reflecting a shadowy side such as those on album Through the Forest through to upbeat songs such as Summer Sun, Benny’s killer voice and songwriting talents have impressed audiences far and wide. Benny took home the gong for Best Aboriginal Act at The Age Music Victoria Music Awards in 2019 as well as being nominated for four NIMA awards in the same year. In 2017 Benny released hit single Ghost from his latest EP Undercover, both debuting at No.1 on the iTunes Blues chart.","url":"https://www.portfairyfolkfestival.com/benny-walker/","twitter":"","created_at":"2019-09-12T04:16:37.630Z","updated_at":"2020-01-06T03:24:54.475Z","image_file_name":"Benny_Walker_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":83083,"image_updated_at":"2020-01-06T03:24:54.182Z","artist_type":"musician","country":"AUS"},{"id":330,"name":"Big Rory \u0026 Friends","bio":"Big Rory and Ochie the Dog are no ordinary street theatre characters. They explode onto an audience. A giant Scotsman and his endearing giant dog. Visually enormous, their characters are huge too. People (and often dogs) fall in love with Ochie. They look adoringly into his eyes, they can’t help cuddling him, but he’s a rascal too, full of surprises. This is one of the best street theatre walkabouts in the world.","url":"https://www.portfairyfolkfestival.com/big-rory-ochy/","twitter":"","created_at":"2020-01-06T01:59:37.927Z","updated_at":"2020-01-06T03:28:17.002Z","image_file_name":"big_rory_600x400_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":303164,"image_updated_at":"2020-01-06T03:28:16.645Z","artist_type":"musician","country":"AUS"},{"id":327,"name":"Bobby Alu","bio":"Byron Bay singer, ukulele strummer and drummer Bobby Alu brings his smooth harmonies and rhythms inspired by a strong family lineage of Polynesian performance to Port Fairy. Alu’s tunes have way of sneaking into the subconscious and taking up residence. Every now and then, one will pop up as a toe-tapping reminder to take it slow and enjoy the ride. Though it’s not all palm trees and daydreams – there’s a robust energy in Alu’s mastery of traditional Samoan log drums, and a vitality to his songwriting that nods to world, roots and pop intelligence.","url":"https://www.portfairyfolkfestival.com/bobby-alu/","twitter":"","created_at":"2020-01-06T01:36:24.926Z","updated_at":"2020-01-06T03:29:00.970Z","image_file_name":"Bobby_Alu__1200x800.jpg","image_content_type":"image/jpeg","image_file_size":463082,"image_updated_at":"2020-01-06T03:29:00.556Z","artist_type":"musician","country":"AUS"},{"id":328,"name":"Bob Jensen","bio":"Canadian born and bred Bob Jensen has a lifetime of writing under his belt.  In his youth he was a traveling folk singer and made one recording called First Time Since August, and later went on to write the award-winning novel, Matchbox Funeral.  He has collaborated on songwriting and poetry with many prestigious artists around the world, including Shane Howard, England’s legendary Martin Simpson, Zimbabwe’s Black Umfolosi and Nashville singer-songwriter, Alan Rhody who has had #1 radio hits in America and Australia and who has been covered by dozens of country music legends such as George Jones, The Oakridge Boys and Tanya Tucker. In 2017, Jensen completed a book of 100 poems interpreting the paintings of Marc Chagall, an artist he has loved since he was a child.  He is currently working on several print and spoken word projects and has a regular feature on CBC Radio performing and discussing his poetry.  In 2020 he will tour Canada, England, Europe, Australia and Zimbabwe.","url":"https://www.portfairyfolkfestival.com/bob-jensen-2/","twitter":"","created_at":"2020-01-06T01:36:42.704Z","updated_at":"2020-01-06T03:29:36.790Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"CAN"},{"id":387,"name":"Brett Clarke","bio":"","url":"http://","twitter":"","created_at":"2020-01-16T01:24:50.877Z","updated_at":"2020-01-16T01:24:50.877Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":276,"name":"Chitra","bio":"Local singer songwriter Chitra seamlessly weaves the blunt force of rock n roll with the candid storytelling and heartache of country and soul.\r\nGrowing up amongst the rich music scene of the Bellarine Peninsula, Chitra found herself fully immersed with sounds both local and global and quickly developed a passion for songwriting. Chitra experiments with a variety of genres from folk to rhythm and blues, resulting in a robust vocal backed by jangly guitars and playful beats.\r\n","url":"https://www.portfairyfolkfestival.com/chitra/","twitter":"","created_at":"2019-09-12T04:18:54.350Z","updated_at":"2020-01-06T03:29:58.412Z","image_file_name":"Chitra_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":407623,"image_updated_at":"2020-01-06T03:29:58.055Z","artist_type":"musician","country":"AUS"},{"id":277,"name":"Claymore","bio":"Claymore’s reputation as outstanding entertainers has led them to perform at many local and international festivals including the Festival Interceltique in France – the largest Celtic festival in the world. With a mixture of traditional Scottish and Irish music and modern self-penned Celtic rock, the band represents the best of new age folk music. Through a diverse and unique mix of sounds featuring guitar, mandolin, fiddle, military snare, the highland bagpipes and even a didgeridoo, it is little wonder Claymore are one of Australia’s most popular festival acts and also a Port Fairy Folk Festival favourite. ","url":"https://www.portfairyfolkfestival.com/claymore/","twitter":"","created_at":"2019-09-12T04:19:34.631Z","updated_at":"2020-01-06T03:30:14.177Z","image_file_name":"Claymore_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":266489,"image_updated_at":"2020-01-06T03:30:13.856Z","artist_type":"musician","country":"AUS"},{"id":278,"name":"Còig","bio":"Còig’s music is a unique combination of influences that come from the four players: Darren McMullen, Rachel Davis, Jason Roach and Chrissy Crowley. Hot off the back of the release of their new album Ashlar, Còig comes to Port Fairy Folk Festival with their lively sets and tender traditional ballads through to fabulous covers – everything the band is known for – with a nod to the deep roots that inspired all four musicians to start playing Celtic music in the first place. Còig performs the best in traditional music, in a non-traditional way. ","url":"https://www.portfairyfolkfestival.com/coig/","twitter":"","created_at":"2019-09-12T04:21:43.710Z","updated_at":"2020-01-06T03:30:30.809Z","image_file_name":"Coig_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":258471,"image_updated_at":"2020-01-06T03:30:30.491Z","artist_type":"musician","country":"CAN"},{"id":331,"name":"Connected Circus","bio":"Bursting with creativity and movement, Connected Circus has something for everyone, from interactive puppet theatre, hula hoop and ninja training workshops to sparkling UV and LED shows. Be entertained, amazed, involved and connected!","url":"https://www.portfairyfolkfestival.com/connected-circus-2/","twitter":"","created_at":"2020-01-06T01:59:58.114Z","updated_at":"2020-01-06T03:31:22.177Z","image_file_name":"conectedcircus_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":481089,"image_updated_at":"2020-01-06T03:31:21.762Z","artist_type":"kids","country":"AUS"},{"id":332,"name":"Cool Out Sun","bio":"Cool Out Sun are a unique cross-cultural project composed of the super-powers that are N’fa Jones (1200 Techniques), Sensible J (REMI, House of Beige) and Nui Moon (Public Opinion Afro Orchestra). The beats provocative, the lyrics powerfully imaginative. The outfit effortlessly infuse multiculturalism with rhythm, afro funk with positive energy, whilst N’fa exudes a hip hop prowess that sees bedrooms turn into dancefloors. Their debut LP displays the group’s creative diversity and freedom with traditional instrumentation, featuring guest artist Lamine Sonko (African Intelligence). The collective invite a range of artist’s influences to collaborate during live shows, diversifying an ever changing, seasonal soundscape in world/roots music.","url":"https://www.portfairyfolkfestival.com/cool-out-sun/","twitter":"","created_at":"2020-01-06T02:00:15.101Z","updated_at":"2020-01-06T03:32:13.193Z","image_file_name":"Cool_Out_Sun_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":367811,"image_updated_at":"2020-01-06T03:32:12.844Z","artist_type":"musician","country":"AUS"},{"id":279,"name":"C.W. Stoneking","bio":"There are many strands to C.W. Stoneking’s music, he is often presented as a ‘blues artist,’ but the term disguises what makes his music special. A 1920s pre-war blues sound is key, with equal helpings of New Orleans jazz, jug band music, hokum, country and calypso, and he’s lately brought in elements of jump jive, early rock’n’roll and gospel. After charming audiences with acoustic guitars, national resonators, banjos and a band laden with brass on his first two albums, he dropped all of that to go electric with his latest album Gon’ Boogaloo (2014), which was all about his Fender Jazzmaster and doo-wop backing vocals. Not that he’s ditched his acoustic; his most recent tour was a solo affair: just him and his 1937 Epiphone Deluxe. His songs are irreverent and fantastical; his albums are full of humorous tales of talking animals, hoodoo gone wrong and a myriad of characters in unfortunate situations in locations from jail to the jungle to heaven itself. ","url":"https://www.portfairyfolkfestival.com/c-w-stoneking/","twitter":"","created_at":"2019-09-12T04:23:40.707Z","updated_at":"2020-01-06T03:32:31.520Z","image_file_name":"CW_Stoneking_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":395569,"image_updated_at":"2020-01-06T03:32:30.748Z","artist_type":"musician","country":"AUS"},{"id":281,"name":"Daniel Champagne","bio":"Daniel Champagne exudes a natural ease on stage, as he sings poignant lyrics and beautifully crafted melodies that invariably whisk the heart up with grand romanticism. Exhilarating guitar talent that transcends mere acoustic playing to replicate a whole band. Champagne has toured and shared the stage with Tommy Emmanuel, Kaki King, Lucinda Williams, Judy Collins, John Butler, Ani DiFranco, Jake Shimabukuro, Rodrigo Y Gabriela, and Albert Lee. ","url":"https://www.portfairyfolkfestival.com/daniel-champagne-2/","twitter":"","created_at":"2019-09-12T04:24:25.533Z","updated_at":"2020-01-06T03:32:48.233Z","image_file_name":"Daniel_Champagne_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":186451,"image_updated_at":"2020-01-06T03:32:47.841Z","artist_type":"musician","country":"AUS"},{"id":282,"name":"Dan Sultan","bio":"ARIA award-winning singer and songwriter Dan Sultan has been a singular musical presence in Australia since the release of his first album, Homemade Biscuits in 2006.\r\nFollowing on from the success of his 2018 EP, Killer Under a Blood Moon which saw Australian artists A.B. Original, Camp Cope, Meg Mac, and Gang of Youths frontman Dave Le’aupepe recreate works from his leading album Killer, Sultan has released his debut kids album, Nali \u0026 Friends, and in this special Port Fairy Folk Festival event he will be performing favourite music from across his career.\r\n","url":"https://www.portfairyfolkfestival.com/dan-sultan/","twitter":"","created_at":"2019-09-12T04:25:18.609Z","updated_at":"2020-01-06T03:33:04.710Z","image_file_name":"Dan_Sultan_1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":223542,"image_updated_at":"2020-01-06T03:33:04.391Z","artist_type":"musician","country":"AUS"},{"id":285,"name":"Eleanor McEvoy","bio":"Eleanor McEvoy began her career as a session musician in Dublin, playing for numerous recordings and artists including U2, Sinead O’Connor and Mary Black. McEvoy was a violinist with the National Symphony Orchestra of Ireland for five years, but her real passion was song writing. Her critically acclaimed canon of work spans fifteen albums and appearances on numerous compilation albums. She has also had numerous cover versions of her songs by performers such as Emmylou Harris, Mary Black, Phil Coulter, Mary Coughlan, Bella Hardy, Eliza Carthy, Derek Ryan, Jack L and up and coming Irish band Saint Sister. McEvoy’s latest album Forgotten Dreams (2019) was recorded in Air Studios in London as a direct-cut-to-vinyl.\r\n","url":"https://www.portfairyfolkfestival.com/eleanor-mcevoy/","twitter":"","created_at":"2019-09-12T04:29:04.384Z","updated_at":"2020-01-06T03:33:41.008Z","image_file_name":"Eleanor_McEvoy_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":263275,"image_updated_at":"2020-01-06T03:33:28.694Z","artist_type":"musician","country":"IRL"},{"id":286,"name":"Emily Wurramara  ","bio":"Brisbane-based emerging songwriter Emily Wurramara’s childhood was one of water and music. Growing up on Groote Eylandt in the Gulf of Carpentaria, days were filled with travel, fishing and extended family, a mother telling stories; seeds being sown for her future compositions. In 2018 Wurramara was nominated for an ARIA for Best Blues and Roots for her debut album Milyakburra, produced by David Bridie and which saw Wurramara singing in both her mother tongue Anindiyakwa and English.","url":"https://www.portfairyfolkfestival.com/emily-wurramara%E2%80%AF/","twitter":"","created_at":"2019-09-12T04:30:13.864Z","updated_at":"2020-01-06T03:33:56.493Z","image_file_name":"Emily_Wurramara_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":201414,"image_updated_at":"2020-01-06T03:33:56.174Z","artist_type":"musician","country":"AUS"},{"id":340,"name":"Evie Mae","bio":"Evie Mae writes and rehearses here in Port Fairy, and the town and surrounding coastline are the inspirations for her sublime songwriting. Her lyrics reflect a fierce loyalty to the people she loves, a delight in the natural world around her, and a level of deep concern that’s rarely found in such a young performer. Her career highlights to date have been winning the 2019 Port Fairy Folk Festival busking competition, and recording her own work in a professional studio in Melbourne.\r\nWatch this space: once you’ve heard Evie Mae at the Folkie, you’ll be seeing her name all over the place.","url":"http://","twitter":"","created_at":"2020-01-06T02:03:05.342Z","updated_at":"2020-01-06T03:35:10.257Z","image_file_name":"Evie_Mae_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":283941,"image_updated_at":"2020-01-06T03:35:09.931Z","artist_type":"musician","country":"AUS"},{"id":287,"name":"Fara","bio":"At the forefront of contemporary Scottish folk, Orcadian quartet Fara make their Port Fairy Folk Festival debut with material from their second album, Times From Times Fall. Comprised entirely of self-penned songs and instrumentals, the young four-piece including Jennifer Austin, Kristan Harvey, Jeana Leslie and Catriona Price produce a spirited sound rooted in their remote homeland. Combining the unique Orkney fiddle tradition with contemporary songs and melodies, Fara celebrate the unity of their musical beginnings blending their four distinctively different musical voices together. Featuring words by Orcadian poets: George McKay Brown, Edwin Muir and Christina Costie; the images of Orkney running through these songs will evoke a sense of home and tradition.","url":"https://www.portfairyfolkfestival.com/fara/","twitter":"","created_at":"2019-09-12T04:30:59.431Z","updated_at":"2020-01-06T03:35:31.874Z","image_file_name":"Fara_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":294265,"image_updated_at":"2020-01-06T03:35:31.512Z","artist_type":"musician","country":"SCO"},{"id":288,"name":"Find Your Voice All Abilities Choir","bio":"The Find Your Voice Choir is a celebration of human spirit. Established in southwest Victoria by singer/songwriter Tom Richardson and All Abilities Advocacy mentor Kylie Thulborn, the choir grew from humble grass-roots meetings into showcase performances at the 2018 Port Fairy Folk Festival. The choir features over 200 members from all corners of southwest Victoria and welcomes members of all abilities, ages, genders, ethnicities, sexual preferences, religions and backgrounds. Find Your Voice Choir continues to attract international attention prompting standing ovations and is one of the largest choir of its nature.","url":"https://www.portfairyfolkfestival.com/find-your-voice-all-abilities-choir-2/","twitter":"","created_at":"2019-09-12T04:32:13.971Z","updated_at":"2020-01-06T03:35:56.812Z","image_file_name":"FYV_choir2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":374639,"image_updated_at":"2020-01-06T03:35:56.479Z","artist_type":"musician","country":"AUS"},{"id":289,"name":"Flats \u0026 Sharps ","bio":"Flats \u0026 Sharps are a high-energy contemporary Bluegrass band, from Penzance, Cornwall, in the South West of England, known for their own highly original songs as well as their blistering renditions of Bluegrass classics. These four incredible young musicians, Mikey Ponsford (mandolin, vocals), Josh Warner (guitar, vocals), Danny Hart (fiddle, banjo, vocals) and Liam Fitzharris (double bass, vocals), honed their skills in hundreds of live performances over the past eight years, charming and wowing audiences along the way. They've come a long way from their humble beginnings busking in Penzance as 17 year-olds, to performing at the Proms in Hyde Park, London, and at scores of festivals throughout the UK, Ireland, Europe, the US and Australia. ","url":"https://www.portfairyfolkfestival.com/flats-sharps/","twitter":"","created_at":"2019-09-12T04:33:03.005Z","updated_at":"2020-01-06T03:36:16.777Z","image_file_name":"Flats___Sharps_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":325578,"image_updated_at":"2020-01-06T03:36:16.443Z","artist_type":"musician","country":"UK"},{"id":290,"name":"Gina Williams \u0026 Guy Ghouse","bio":"Gina Williams and Guy Ghouse have firmly established a reputation for bringing a fresh, modern take on ancient traditions; merging evocative sounds, natural acoustic instruments, poignant stories an incredible, beautiful voice. The natural rhythms of the Noongar language are perfectly captures and represented, and there’s an onstage connection and charisma that comes from two good friends who simply won’t quit. Williams has on four separate occasions taken out the WA Music Industry Award for Best Indigenous Artist. Telling her story and singing these beautiful crafted songs and often in her now rarely spoken language is deeply personal and something to share.\r\n","url":"https://www.portfairyfolkfestival.com/gina-williams-guy-ghouse/","twitter":"","created_at":"2019-09-12T04:33:56.720Z","updated_at":"2020-01-06T03:36:35.769Z","image_file_name":"Gina_Williams___Guy_Ghouse_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":286582,"image_updated_at":"2020-01-06T03:36:35.448Z","artist_type":"musician","country":"AUS"},{"id":291,"name":"Grace Petrie","bio":"Grace Petrie’s unique takes on life, love and politics, and the warmth and wit with which they are delivered, have won over an army of loyal fans across the alternative, folk, political and comedy scenes.  Petrie has toured with Frank Turner and Billy Bragg, supported comedians Robin Ince and Josie Long, and collaborated with Leon Rosselson and Peggy Seeger.  Petrie has been a frequent guest on BBC Radio 4’s the Now Show and has appeared on Channel 4’s Random Acts.  Petrie comes to Port Fairy Folk Festival following successful festival appearances at Vancouver Folk Festival, Latitude, Cambridge Folk Festival, and The Acoustic Stage at Glastonbury Festival. Her latest album, Queer As Folk (2018) was a Mojo magazine top 10 Folk Album of the Year","url":"https://www.portfairyfolkfestival.com/grace-petrie/","twitter":"","created_at":"2019-09-12T04:34:31.897Z","updated_at":"2020-01-06T03:36:50.541Z","image_file_name":"Grace-Petrie-photo-credit-David-Wilson-Clarke-13_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":188148,"image_updated_at":"2020-01-06T03:36:50.226Z","artist_type":"musician","country":"UK"},{"id":334,"name":"Harry Shearer","bio":"Actor… author… director… comedian… musician… philosopher… political satirist… record-company owner… and one of the best “voices” in the business (just ask The Simpsons), Harry Shearer is a comic personality and modern day renaissance man.\r\n\r\nFor the past two decades he has enjoyed enormous success and planted the fruits of his talents in the heads of millions worldwide thanks to his voice work for The Simpsons, where he plays a stable of characters: most notably Mr. Burns, Smithers, and insufferable neighbour Ned Flanders.\r\n\r\nMovie audiences will know Shearer best for his collaborations with Christopher Guest and friends. The most famous of these is the granddaddy of all mock-umentaries, This Is Spinal Tap (with Rob Reiner and Michael McKean). The film revealed the concepts of spontaneously combusting drummers and amps that go up to eleven. Spinal Tap – the band have enjoyed worldwide success performing live and five years ago stole the show at the Live Earth concert at Wembley, London. In 2009 Harry, Christopher and Michael reunited to tour an acoustic version of Spinal Tap songs as themselves in the Unwigged and Unplugged tour and returned as Derek Smalls, Nigel Tufnel and David St. Hubbins to play Glastonbury and Wembley Arena with the volume turned up to eleven. Other Guest collaborations have included A Mighty Wind and For Your Consideration. At Port Fairy Harry will perform with Judith Owen (Wales) and also be a part of a very special and exclusive On The Couch with Brian Nankervis to be followed by a special screening o the iconic folk mock-umentary A Mighty Wind.","url":"https://www.portfairyfolkfestival.com/harry-shearer/","twitter":"","created_at":"2020-01-06T02:01:21.129Z","updated_at":"2020-01-06T03:37:52.290Z","image_file_name":"Harry_Shearer_photo_by_Michael_Sherer_-1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":289161,"image_updated_at":"2020-01-06T03:37:51.915Z","artist_type":"musician","country":"USA"},{"id":335,"name":"Heidi Hoops","bio":"Heidi Hoops is a renowned performer who has played on cruise liners in the Southern Pacific Ocean, and at many clubs and corporate events. She has swung hoops and loops in Circus Monoxide’s Big Top, the Tiny Top, with Six Quick Chicks, and on the European Summer Street Festival Circuit.  She has generated laughter in Sydney’s premier cabaret, magic and burlesque venues including, 34B and The Gangsta’s Ball. Her solo show, Lost and Found – The Sugar Candy Show premiered at the inaugural Sydney Fringe Festival. She constructs and performs educational shows for youth audiences, but her real passion is the wild thrill of late night comedy.","url":"https://www.portfairyfolkfestival.com/heidi-hoops/","twitter":"","created_at":"2020-01-06T02:01:37.341Z","updated_at":"2020-01-06T03:38:45.225Z","image_file_name":"Heidi_Hoops_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":274046,"image_updated_at":"2020-01-06T03:38:44.888Z","artist_type":"musician","country":"AUS"},{"id":336,"name":"Hell Ship","bio":"Michael Veitch has put together another one-man show, this time telling the true story of on one of the most dramatic, yet now forgotten chapters of Australia’s early maritime history. Hell Ship is a tale of hardship and heroism; of survival and love.\r\n\r\nIn the spring of 1852, the emigrant clipper Ticonderoga limped through the heads of Melbourne’s Port Phillip Bay after a three-month voyage from Liverpool. By the time she reached Australia, she was a floating catastrophe. Shortly after crossing the equator, typhus had erupted throughout her decks, and in just a few weeks, one hundred of her mainly Highland Scots emigrants had perished, hastily buried at sea with what little ceremony could be afforded. Schools of sharks, it was said, had stalked Ticonderoga’s progress across the oceans. \r\n\r\nForbidden to enter Melbourne, the Ticonderoga was made to offload her human cargo onto a small beach inside the heads where, for the next six weeks, a makeshift quarantine hospital was established. Through the tireless efforts of the ship’s young surgeon, aided by a handful of passengers, including a courageous young Scots woman from the Isle of Mull, many lives were saved, which went on to establish Australian families which thrive to this day. In a subsequent enquiry into the disaster, the young surgeon emerged as the hero of the Ticonderoga story, was briefly feted, then disappeared into a quiet life as a country doctor. As these stories sometimes go, he married the young nurse, and the two lived a long and happy life.\r\n\r\nThey were also Michael Veitch’s Great-great grandparents, James William Henry Veitch and Annie Morrison. Hell Ship is very much a family story.\r\n","url":"https://www.portfairyfolkfestival.com/hell-ship/","twitter":"","created_at":"2020-01-06T02:01:47.250Z","updated_at":"2020-01-06T03:39:55.367Z","image_file_name":"Hell_Ship_Quarantine_3___Web_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":162351,"image_updated_at":"2020-01-06T03:39:55.010Z","artist_type":"musician","country":"AUS"},{"id":292,"name":"Hubert Francis ","bio":"Hubert Francis was born and raised in Elsipogtog, an Indian Reservation in New Brunswick, Canada. He started his rock group J.Hubert Francis \u0026 Eagle Feather in 1990, with Eagle Feather becoming the first touring Aboriginal rock band in Canada. Releasing three albums, including the award-winning Message From a Drum in 1999, Francis and Eagle Feather have toured the world with their fusion of native chants and contemporary rock sounds. Hubert Francis and Eagle Feather have been nominated for numerous high profile awards including a Native American Music Award and two Juno nominations. Francis recently completed the filming of a documentary series, Eastern Tide, co-directing, performing and narrating in the Mi kmaq language.\r\n","url":"https://www.portfairyfolkfestival.com/hubert-francis/","twitter":"","created_at":"2019-09-12T04:35:28.479Z","updated_at":"2020-01-06T03:40:15.071Z","image_file_name":"Hubert_Francis_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":161176,"image_updated_at":"2020-01-06T03:40:14.772Z","artist_type":"musician","country":"CAN"},{"id":293,"name":"Ian Sherwood","bio":"Armed with a saxophone, guitar, looping pedal and a voice that won him a Canadian Folk Music Award for Contemporary Singer of the Year, Ian Sherwood has charmed his way across the country and UK with his unique brand of genre-shifting music and stage show. A natural storyteller with a timeless sound, his influences are some of the best folk/pop/country singer-songwriters; from Bruce Springsteen to Tom Petty and Blue Rodeo. Named Best Male Artist by the International Acoustic Music Awards, twice named Musician of the Year by the Nova Scotia Music Awards. Sherwood has been called “a natural performer who entertains as much with his wit and stories as with his songs” – CBC Radio.","url":"https://www.portfairyfolkfestival.com/ian-sherwood/","twitter":"","created_at":"2019-09-12T04:36:22.324Z","updated_at":"2020-01-06T03:40:37.158Z","image_file_name":"Ian_Sherwoood_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":309410,"image_updated_at":"2020-01-06T03:40:36.603Z","artist_type":"musician","country":"CAN"},{"id":358,"name":"Irish Set Dancing","bio":"","url":"http://","twitter":"","created_at":"2020-01-07T06:02:59.206Z","updated_at":"2020-01-07T06:02:59.206Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":337,"name":"Jeff Lang","bio":"Jeff Lang has built a reputation for making startling music that is accomplished, intricate, gutsy, melodic and loaded with soul. Often taking unexpected turns, he has consistently inspired his audiences by creating stylistically and diverse music for all to be besotted by. Jeff has mischievously called his music Disturbed Folk, and he has been hailed a ‘national treasure’ by John Butler. Jeff’s latest album, Alone in Bad Company, presents the most organic union of his talents and influences yet. It’s filled with exquisitely sung stories and melodies, demonstrating that Jeff is nothing if not a lover of song.","url":"https://www.portfairyfolkfestival.com/jeff-lang-2/","twitter":"","created_at":"2020-01-06T02:02:14.776Z","updated_at":"2020-01-06T03:41:22.774Z","image_file_name":"Jeff_Lang_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":291140,"image_updated_at":"2020-01-06T03:41:22.421Z","artist_type":"musician","country":"AUS"},{"id":356,"name":"Jim Haynes","bio":"","url":"http://","twitter":"","created_at":"2020-01-07T06:02:21.443Z","updated_at":"2020-01-07T06:02:21.443Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":295,"name":"John McCutcheon","bio":"John McCutcheon has emerged as one of the most respected and loved folk/contemporary artists of the post-war generation. As an instrumentalist, he is a master of a dozen different traditional instruments, most notably the rare and beautiful hammer dulcimer. His song writing has been hailed by critics and singers around the globe, while his 35+ recordings have garnered every imaginable honour including six Grammy nominations. In his Port Fairy Folk Festival appearance, McCutcheon will perform songs by Pete Seeger from his tribute album, plus favourites.","url":"https://www.portfairyfolkfestival.com/john-mccutcheon/","twitter":"","created_at":"2019-09-12T04:38:00.895Z","updated_at":"2020-01-06T03:41:44.563Z","image_file_name":"John_McCutcheon_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":352528,"image_updated_at":"2020-01-06T03:41:44.180Z","artist_type":"musician","country":"USA"},{"id":296,"name":"John Smith ","bio":"With his honey-on-gravel voice and mesmerising fingerstyle guitar, John Smith has built a reputation as one of England’s finest guitarists and songwriters. Steeped in the lineage of British folk, taking his cue from Richard Thompson and John Martyn, Smith has evolved a transatlantic blend of fingerstyle and slide guitar techniques. Smith’s intimate take on love, loss and the journey we make, combined with his innovative guitar work, have won him a loyal following around the globe. 2019 saw the release of Smith’s fifth album Hummingbird. Prior to this Smith has played with, or opened for Davy Graham, John Martyn and John Renbourn, who dubbed him ”The future of folk music”.","url":"https://www.portfairyfolkfestival.com/john-smith/","twitter":"","created_at":"2019-09-12T04:38:37.535Z","updated_at":"2020-01-06T03:42:05.355Z","image_file_name":"John_Smith_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":358090,"image_updated_at":"2020-01-06T03:42:05.014Z","artist_type":"musician","country":"UK"},{"id":338,"name":"Judith Owen","bio":"Judith Owen, the firebrand singer-songwriter and pianist is currently riding the wave of a tremendous couple of years. Her previous album Somebody’s Child was adored by critics around the world with The Sunday Times UK selecting it as one of the best records of 2016 and Analog Planet stating that it ‘’sparkles with Owen’s witty energy’’ and noting that ‘’the songs will stay with you long after the record ends.’’ Owen’s live performances, whether as a headliner or as the handpicked opening act for Bryan Ferry’s recent tours of Europe and North America, have been wowing listeners and gaining fans like fellow artist Jackson Browne, who said of Owen’s onstage prowess: ‘’It’s a masterclass on how a show should be done’’.","url":"https://www.portfairyfolkfestival.com/judith-owen/","twitter":"","created_at":"2020-01-06T02:02:32.877Z","updated_at":"2020-01-06T03:43:03.363Z","image_file_name":"JudithOwenA_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":289232,"image_updated_at":"2020-01-06T03:43:03.049Z","artist_type":"musician","country":"UK"},{"id":297,"name":"Kieran Kane \u0026 Rayna Gellert ","bio":"Kieran Kane and Rayna Gellert are the musical kindred spirits behind Kane Gellert. Kane’s seminal work in The O'Kanes and Kane Welch Kaplin, and as co-founder of independent label Dead Reckoning Records, laid the foundation for the contemporary world of Americana music. Kane has written songs for Alan Jackson, John Prine, Emmylou Harris and more as well as being a successful solo artist in his own right. Gellert turned to Appalachian old-time music at a young age, becoming a prodigious fiddler and leading a new revival of American string band music through her work with the acclaimed roots band Uncle Earl. Gellert has toured and recorded with artists such as Scott Miller, Abigail Washburn, Toubab Krewe and Robyn Hitchcock.  ","url":"https://www.portfairyfolkfestival.com/kieran-kane-rayna-gellert/","twitter":"","created_at":"2019-09-12T04:39:29.587Z","updated_at":"2020-01-06T03:43:26.648Z","image_file_name":"Kieran_Kane___Rayna_Gellert_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":368519,"image_updated_at":"2020-01-06T03:43:26.205Z","artist_type":"musician","country":"USA"},{"id":339,"name":"Krazy Koala Puppet Show","bio":"Here to delight audiences with their catchy songs and krazy puppet dance moves, the Krazy Koala Puppet Show have toured the UK , where the Puppets performed at many festivals, including Glastonbury. Their latest CD Puppets Like To Party was released early in 2016. This show is fantastic for the entire family.","url":"https://www.portfairyfolkfestival.com/krazy-koala-puppet-show-2/","twitter":"","created_at":"2020-01-06T02:02:55.155Z","updated_at":"2020-01-06T03:47:30.861Z","image_file_name":"Krazy-Koala-Puppet-Show_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":215577,"image_updated_at":"2020-01-06T03:47:15.183Z","artist_type":"kids","country":"AUS"},{"id":357,"name":"Maggie Somerville","bio":"","url":"http://","twitter":"","created_at":"2020-01-07T06:02:38.483Z","updated_at":"2020-01-07T06:02:38.483Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":301,"name":"Māmā Mihirangi \u0026 The Māreikura","bio":"New Zealand’s queen of live loops Māmā Mihirangi \u0026 The Māreikura take the stage by storm with a powerful show of stunning contemporary Māori music, dance, instruments, language, stories and costumes. Weaving ancient changes with intricate harmonies, traditional and contemporary instruments, beats and deep bass, the powerful and fierce all-female Māori world-roots production is led by internationally renowned artist and activist Māmā Mihirangi. Traditional female dancers, Māreikura perform alongside, presenting the virtues of feminine power and inspiring cultural identity with the women’s haka, traditional weaponry and Māori martial arts combined into a contemporary cultural performance.","url":"https://www.portfairyfolkfestival.com/mama-mihirangi-the-mareikura/","twitter":"","created_at":"2019-09-12T04:43:50.936Z","updated_at":"2020-01-06T03:47:56.490Z","image_file_name":"Māmā_Mihirangi___the_Māreikura_Small_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":302280,"image_updated_at":"2020-01-06T03:47:56.049Z","artist_type":"musician","country":"NZ"},{"id":389,"name":"Maya Linnell","bio":"","url":"http://","twitter":"","created_at":"2020-01-16T01:25:23.745Z","updated_at":"2020-01-16T01:25:23.745Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":342,"name":"Ned Kelly","bio":"Ned Kelly is the infamous Australian outlaw. Ashley Davies, one of Australia’s finest composers collaborated with the late Ian Jones, historian and author, regarded as a leading authority on the life an times of Ned Kelly, to create this outstanding multi media production. Since then, Ashley has collaborated with Derek Guille to reinvigorate this outstanding production which will feature a live narration with Derek, and Ashley has gathered some of Australia’s finest musicians to to join him perform the live music score, they are Michael Lewitt, Monique DiMattina, Rosie Westbrook and Shannon Bourne. This is an evocative retelling of the life of Australia’s best known folk legend, featuring archival images carefully drawn together, which combined with the music is nothing short of captivating.\r\n","url":"https://www.portfairyfolkfestival.com/ned-kelly/","twitter":"","created_at":"2020-01-06T02:03:33.227Z","updated_at":"2020-01-06T03:49:07.989Z","image_file_name":"Ned_Kelly_cover_art_low_res_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":76731,"image_updated_at":"2020-01-06T03:49:07.657Z","artist_type":"musician","country":"AUS"},{"id":302,"name":"Neil Murray","bio":"Maverick song man Neil Murray was a founding member of the Warumpi Band, which in the 1980s penetrated mainstream Australia with the iconic anthems My Island Home and Blackfella Whitefella. He has since become a respected singer/songwriter, releasing a string of remarkable albums. His latest are Blood and Longing and Tjungu with Sammy Butcher. Covered widely, Murray’s songwriting is diverse and his work has contributed to a deepening of Australian contemporary music. In 2017 Murray was names the Port Fairy Folk Festival Artist of the Year.","url":"https://www.portfairyfolkfestival.com/neil-murray-2/","twitter":"","created_at":"2019-09-12T04:44:34.443Z","updated_at":"2020-01-06T03:49:33.247Z","image_file_name":"Neil_Murray_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":271010,"image_updated_at":"2020-01-06T03:49:32.894Z","artist_type":"musician","country":"AUS"},{"id":341,"name":"Nick Charles","bio":"His dazzling, melodic finger picking on 6 and 12 string guitars, stinging slide and a lifetime’s stories and songs from the musical highway has him labelled by The Age as “Australia’s virtuoso of acoustic roots and blues.\" During an extensive and acclaimed career, Nick has released many albums on major roots and guitar music labels. He has garnered world-wide recognition for a series of releases on Black Market Music, beginning with My Place and now his most recent albums, Closer to Home and Return of the Travelling Fingerpicker.","url":"https://www.portfairyfolkfestival.com/nick-charles-3/","twitter":"","created_at":"2020-01-06T02:03:22.995Z","updated_at":"2020-01-06T03:51:32.507Z","image_file_name":"Nick_Charles_-_New_Portrait_Jun_2016_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":109138,"image_updated_at":"2020-01-06T03:51:32.157Z","artist_type":"musician","country":"AUS"},{"id":343,"name":"Niq Reefman","bio":"NIQ is not normal. NIQ is not mainstream. If you don’t like surprises, you should probably leave now… Since taking human form, he has chased the magic and dodged the mundane. An experimentalist since the beginning, NIQ lives by the mantra that he will try almost anything at least once. NIQ had an alternative upbringing, home-schooled with five siblings and spoon-fed classical radio by a hippy piano-teaching matriarch, he found his calling when encountering the local trumpeter perform at church. From here, you can expect anything. Experience NIQ’s street-performing magic at the Port Fairy Folk Festival in March.\r\n\r\nAussie Artsong – Banjo Patterson edition\r\nA selection of lesser-known works of Andrew Barton “Banjo” Paterson put to original music that convey the character of each work. Wrapped in luxurious melodies and instrumentation, the show is delivered in a speakeasy style, pairing catchy tunes with biographical stories.\r\n\r\nGizmo Guy\r\nFollow the gypsy who plays trumpet \u0026 accordion on the streets.Try one of the musical gizmos from his box and learn how to jam (improvise) without even knowing it!","url":"https://www.portfairyfolkfestival.com/niq-reefman/","twitter":"","created_at":"2020-01-06T02:03:58.040Z","updated_at":"2020-01-06T03:54:23.136Z","image_file_name":"Gizmo_Guy_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":257954,"image_updated_at":"2020-01-06T03:54:22.819Z","artist_type":"musician","country":"AUS"},{"id":304,"name":"Oriel Glennen","bio":"Oriel Glennen is a folk singer/songwriter who hails from Port Fairy, the home of our Folk Festival. Over the last 15 years, she has performed at various venues and festivals; both nationally and internationally. Her Celtic Cornish heritage and her connection to place is strong through the musical imagery she creates with songs rich in sea tale and folklore and songs that reach out and connect the emotional heart of a song to that of her audience. Oriel is accompanied this year by the outstanding talents of both Kate Garrison on cello and Anna Batson (UK) on keyboard.  ","url":"https://www.portfairyfolkfestival.com/oriel-glennen/","twitter":"","created_at":"2019-09-12T04:45:51.818Z","updated_at":"2020-01-06T03:54:47.116Z","image_file_name":"Oriel_Glennnen_1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":201900,"image_updated_at":"2020-01-06T03:54:46.752Z","artist_type":"musician","country":"AUS"},{"id":305,"name":"Patty Griffin","bio":"Patty Griffin is among the most consequential singer-song writers of her generation, a quintessentially American artist whose wide-ranging canon incisively explores the intimate moments and universal emotions that bind us together. Griffin has had her work performed by a truly epic assortment of her fellow artists including Linda Ronstadt, Emmylou Harris, Dixie Chicks, Kelly Clarkson and Jeff Beck to name but a few. Over the course of two decades, the Grammy® Award-winner – and seven-time nominee – has crafted nine classic studio albums and two live collections. Patty Griffin’s new self-titled album represents an extraordinary new chapter for this incomparable musician. \r\n","url":"https://www.portfairyfolkfestival.com/patty-griffin/","twitter":"","created_at":"2019-09-12T04:47:08.809Z","updated_at":"2020-01-06T03:55:07.083Z","image_file_name":"Patty_Griffin_Michael_Wilson_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":309728,"image_updated_at":"2020-01-06T03:55:06.762Z","artist_type":"musician","country":"USA"},{"id":306,"name":"Paul McKenna Band","bio":"Labelled as “the best folk band to have come out of Scotland in the last twenty years” by the New York Times, award-winning Glasgow singer Paul McKenna is ranked among Scotland’s finest young songwriters, armed with a powerful yet intensely emotive voice and passionate social conscience. Alongside Conor Markey (banjo, bouzouki, guitars) and Ewan Baird (percussion), Paul McKenna draws on both Scottish and Irish roots in a dynamic full-bodied array of original and traditional material. ","url":"https://www.portfairyfolkfestival.com/paul-mckenna-trio/","twitter":"","created_at":"2019-09-12T04:47:49.228Z","updated_at":"2020-01-06T03:56:57.264Z","image_file_name":"Paul_McKenna_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":166968,"image_updated_at":"2020-01-06T03:56:56.965Z","artist_type":"musician","country":"SCO"},{"id":344,"name":"Rhainnon Giddens \u0026 Francesco Turrisi","bio":"Rhiannon Giddens is an American folk and traditional music artist who plays fiddle and banjo, and Francesco Turrisi is an Italian pianist and percussionist well versed in jazz, early music and Mediterranean music; at first blush, their worlds don’t overlap.\r\n\r\nWorking together the two musicians trace musical globalism by re-imagining the encounter of the banjo and the frame drum, and other instruments, through their journey from Africa, the Middle East, through southern Europe and England, and over to the Americas. Giddens and Turrisi’s new album There Is No Other was recorded in just five days with little editing and overdubbing in Ireland with producer Joe Henry, and is at once a condemnation of “othering” and a celebration of the spread of ideas, connectivity, and shared experience.","url":"https://www.portfairyfolkfestival.com/rhiannon-giddens-francesco-turrisi/","twitter":"","created_at":"2020-01-06T02:04:43.040Z","updated_at":"2020-01-06T03:57:55.109Z","image_file_name":"Rhiannon_Francesco_photo_by_Karen_Cox_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":223745,"image_updated_at":"2020-01-06T03:57:54.708Z","artist_type":"musician","country":"USA"},{"id":307,"name":"Ruby Gill","bio":"Ruby Gill is leaving permanent potholes in the status quo left by the likes of Joni Mitchell, Glen Hansard and Regina Spektor with career-defining grit, overwhelming honesty and unique insight into the worlds of bird, border security and panic attacks. Off the back of a sold-out tour of South Africa, the songwriter unleashed her gritty debut single Your Mum in 2018 which received rave reviews across the globe. Ruby’s immense voice, heavy piano and vulnerable stage presence have been appearing on festivals around the world from Oppikoppi to Woodford. ","url":"https://www.portfairyfolkfestival.com/ruby-gill/","twitter":"","created_at":"2019-09-12T04:48:49.541Z","updated_at":"2020-01-06T03:58:15.491Z","image_file_name":"Ruby_Gill_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":403055,"image_updated_at":"2020-01-06T03:58:15.187Z","artist_type":"musician","country":"AUS"},{"id":345,"name":"Ruth Hazleton \u0026 Daisy Wheel","bio":"Daisywheel is a lyrical voyage from the past through to the uneasy times in which we live; the sound of history, struggle \u0026 resilience in song.\r\n\r\nIt’s also the name of the recently released and highly anticipated first solo album from one of Australia’s most respected folk singers, Ruth Hazleton. A multi-award-winning musician, singer and songwriter, Ruth has toured nationally and internationally in a career spanning twenty-five years. Over this time, she has performed and recorded with iconic musicians from all over the globe including Andy Irvine, Nancy Kerr and Bruce Molsky. Armed with an electric guitar and banjo and a collection of traditional and original songs, Ruth will be joined onstage by a full electric band including Guitars, Banjos, (Fiona Steele), Upright Bass (Oscar Neyland), Drums \u0026 Percussion (Justin Olsson), Mandolin, Oud and Yayli Tambur (Paddy Montgomery). Daisywheel is a stunning new sound brimming with originality and something to say.","url":"https://www.portfairyfolkfestival.com/ruth-hazelton-daisywheel/","twitter":"","created_at":"2020-01-06T02:05:03.256Z","updated_at":"2020-01-06T03:59:12.930Z","image_file_name":"Ruth_Hazleton___Daisywheel_1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":185761,"image_updated_at":"2020-01-06T03:59:12.600Z","artist_type":"musician","country":"AUS"},{"id":308,"name":"Saije","bio":"From Bellingen, NSW, Saije is a multi-instrumental folk pop duo whose soulful voices and transporting guitar interweaves their stories through a blend of harmony and rhythmic strength. The duo’s song writing encourages connection to self, the earth and to each other, inviting audiences on a journey from the depths of ancient forests to bustling French markets, weaving threads of Celtic and French gypsy flavours into their folk tunes along the way. Having toured Europe extensively, Saije recorded and released their second EP Without Walls, and have dazzled audiences at a number of Australia’s festival gems including the Mullumbimby and Cygnet Folk Festivals. In 2019 the duo received the Folk Alliance Australia Young Artist of the Year Award at the National Folk Festival.  ","url":"https://www.portfairyfolkfestival.com/saije/","twitter":"","created_at":"2019-09-12T04:49:27.231Z","updated_at":"2020-01-06T03:59:32.133Z","image_file_name":"Saije_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":210703,"image_updated_at":"2020-01-06T03:59:31.827Z","artist_type":"musician","country":"AUS"},{"id":346,"name":"Sarah Carroll \u0026 Shannon Bourne","bio":"Together Sarah Carroll and Shannon Bourne perform with a profound understanding of great song craft and virtuosic musicianship. Sarah’s songs chime with sincerity and come straight from her big, brave heart; Shannon Bourne is Australia’s foremost free-thinking guitarist.\r\n\r\nSHANNON BOURNE: As long as I’ve known Sarah and seen her play in all of her bands, there is one thing that sticks in my mind: Sarah shines something so beautiful out into a room of people. When she’s feeling bright you can feel it, when she’s feeling mischievous, it’s delicious. When Sarah is feeling sad, you can feel it and empathise. What a power to have! I look forward to playing a special show with her and feeling all there is to feel.\r\n\r\nSARAH CARROLL: Shannon plays with the skill of a lifetime drenched in sound; his music combines muscular dexterity with pin-drop finesse, and his courage, compassion and intelligence glow in every note. He will always belong in our family, as a dear friend, and a musical brother.","url":"https://www.portfairyfolkfestival.com/sarah-carroll-shannon-bourne/","twitter":"","created_at":"2020-01-06T02:05:24.243Z","updated_at":"2020-01-06T04:00:20.494Z","image_file_name":"Sarah_Carroll_and_Shannon_Bourne__1200x800.jpg","image_content_type":"image/jpeg","image_file_size":358812,"image_updated_at":"2020-01-06T04:00:20.102Z","artist_type":"musician","country":"AUS"},{"id":347,"name":"Shane Howard","bio":"For 40 years Shane Howard has established himself as one of Australia’s most influential writers and singers. Howard’s songs created a new map of Australia. From the red heart, where he penned his anthemic Solid Rock, to the wilds of Tasmania that gave birth to Let the Franklin Flow, he’s created a uniquely Australian voice. His songs dig down into what it means to be a modern Australian. They also reach across the globe and champion the cause of the common people, the environment and the injustices of colonisation. Dark Matter, his 14th solo album, continues to plumb the depths, and will be launched at the 2020 festival.","url":"https://www.portfairyfolkfestival.com/shane-howard/","twitter":"","created_at":"2020-01-06T02:05:40.704Z","updated_at":"2020-01-06T04:01:09.444Z","image_file_name":"Shane_Howard_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":253784,"image_updated_at":"2020-01-06T04:01:08.934Z","artist_type":"musician","country":"AUS"},{"id":348,"name":"Sibusile Xaba","bio":"South African charismatic guitarist Sibusile Xaba has a dreamy vocal style which is beautifully combined with a guitar style that is rooted in expressive picking, taking inspiration from mentors such as Madala Kunene and Dr Philip Tabane. Xaba’s debut album, Open Letter to Adoniah is a musical letter to his child, reverent of life and its connectedness to a higher source. The album was recorded in just a few days in the Magaliesberg Mountains, just outside of Johannesburg in 2016.","url":"https://www.portfairyfolkfestival.com/sibusile-xaba/","twitter":"","created_at":"2020-01-06T02:06:24.435Z","updated_at":"2020-01-06T04:01:59.992Z","image_file_name":"Sibusile_Xaba_2_(Photo_by_Harness_Hamese)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":444953,"image_updated_at":"2020-01-06T04:01:59.609Z","artist_type":"musician","country":"AUS"},{"id":349,"name":"Sport Suzie","bio":"This show is full of crazy stunts, from dumbbells flying in the air and super unicycling to riding the smallest bike you’ve possibly ever seen. Check out Suzie’s sweet juggling routine, whilst squeezing her body through a tennis racquet! To finish she’ll skip rope on a 6 foot unicycle. This is a high energy, action-packed, hilarious show the whole family can enjoy. Suzie’s performed almost everywhere, including South Korea for the Military. She’s that crazy Kiwi you wish was your Aunty!","url":"https://www.portfairyfolkfestival.com/sport-suzie-3/","twitter":"","created_at":"2020-01-06T02:06:41.865Z","updated_at":"2020-01-06T04:04:05.970Z","image_file_name":"SportsSuzie_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":155702,"image_updated_at":"2020-01-06T04:04:05.425Z","artist_type":"musician","country":"AUS"},{"id":312,"name":"Startijenn","bio":"Startijenn draws the necessary energy out of its roots to create a powerful, efficient and contemporary sound. Established in 1997 when the founding members were just 13 years old, Startijenn now includes five musicians who fuse traditional instruments with a contemporary rhythmic section offering very lively Breton music through original compositions. After five award-winning studio albums, the group continue to surprise audiences with their unique music drawing from Arabic trance and Breton influences. Rich from musical experiences and from 20 years of touring together, Startijenn is a true world music group.","url":"https://www.portfairyfolkfestival.com/startijenn/","twitter":"","created_at":"2019-09-12T04:55:12.405Z","updated_at":"2020-01-06T04:04:30.404Z","image_file_name":"Startijenn_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":285337,"image_updated_at":"2020-01-06T04:04:30.045Z","artist_type":"musician","country":"AUS"},{"id":313,"name":"Susan O’Neill ","bio":"All the way from Co. Clare, Ireland, the prodigiously gifted Susan O’Neill’s soulful and husky-voiced performances are truly something to behold. With a striking attitude, guitar, harmonica, trumpet and loop pedal, Susan delivers a timeless and powerful blend of the old soul with a new edge.  Described as a ‘ballsier Adele’ by Hotpress magazine and tipped as the traces of Janis Joplin reincarnate, from an early age Susan has picked up many fans including U2’s Bono after covering their Exit song for the 30th anniversary celebration of The Joshua Tree.The incredible range of Susan’s gritty vocal and emotionally charged approach make for a truly unforgettable musical experience.\r\n","url":"https://www.portfairyfolkfestival.com/susan-oneill/","twitter":"","created_at":"2019-09-12T04:55:55.218Z","updated_at":"2020-01-06T04:05:04.287Z","image_file_name":"SON_-_001_(1)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":211357,"image_updated_at":"2020-01-06T04:05:03.930Z","artist_type":"musician","country":"IRL"},{"id":350,"name":"Teeny Tiny Stevies","bio":"A few years ago, sisters Byll and Beth of much-loved folk-pop band The Little Stevies started playing around writing some children’s songs, inspired originally by the need to teach Byll’s three-year-old about the challenges of toilet training. The side-hobby was fulfilling and so effective, before they knew it they’d written and recorded a full-length album called Useful Songs For Little People. It wasn’t long before people outside the realm of their ‘adult’ bands reach started taking notice and championing their music to their friends, family and followers. And that’s when Teeny Tiny Stevies took on a life of its own. Their songs and beautiful animations can now be seen on ABC Kids Television, and their sophomore album has been nominated for an ARIA award. They write kids songs with a purpose and their focus is acceptance.","url":"https://www.portfairyfolkfestival.com/teeny-tiny-stevies/","twitter":"","created_at":"2020-01-06T02:06:54.396Z","updated_at":"2020-01-06T04:08:00.578Z","image_file_name":"Teeny_Tiny_Stevies_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":332362,"image_updated_at":"2020-01-06T04:08:00.163Z","artist_type":"musician","country":"AUS"},{"id":272,"name":"The Blind Boys Of Alabama","bio":"The Blind Boys of Alabama are recognised worldwide as living legends of gospel music. With a career spanning over 70 years, The Blind Boys are known for crossing multiple musical boundaries with their remarkable interpretations of everything from traditional gospel favourites to contemporary spiritual material by songwriters such as Eric Clapton, Prince and Tom Waits. Winners of five Grammy® Awards, The Blind Boys have appeared on recordings with a huge list of artists including Lou Reed, Aaron Neville, Willie Neson, Bonnie Raitt, Ben Harper, Patty Griffin and Taj Mahal.","url":"https://www.portfairyfolkfestival.com/the-blind-boys-of-alabama/","twitter":"","created_at":"2019-09-12T04:14:58.669Z","updated_at":"2020-01-06T04:08:20.529Z","image_file_name":"BBdoorColor_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":356656,"image_updated_at":"2020-01-06T04:08:20.104Z","artist_type":"musician","country":"USA"},{"id":275,"name":"The Burning Hell","bio":"In 2007, Canadian songwriter Mathias Kom quit teaching history and started a band called The Burning Hell after a religious tract, handed to him by a wide-eyed zealot in Toronto. Mathias subsequently invited all of his friends to join him in performing his songs about seagulls, shopping malls, conferences, and the similarities between love and hurricanes. Over the next 10 years and almost as many albums, the line-up and sound of The Burning Hell have changed often, but the band has remained idiosyncratic and unclassifiable – much to the delight of those who love them. The constant has always remained Kom’s singular outlook on the world: wise and naïve, cynical and life-affirming, full of brilliant, unexpected narratives and a deeply felt generosity of spirit. The band’s live performances underscore these themes; they exhibit a joy and camaraderie too infrequently seen on stage. Indeed, the essence of the band is inclusive and celebratory; there’s something for everyone.","url":"https://www.portfairyfolkfestival.com/the-burning-hell/","twitter":"","created_at":"2019-09-12T04:17:11.224Z","updated_at":"2020-01-06T04:08:40.423Z","image_file_name":"The_Burning_Hell_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":320136,"image_updated_at":"2020-01-06T04:08:40.089Z","artist_type":"musician","country":"CAN"},{"id":283,"name":"The East Pointers","bio":"Award-winning Canadian trio The East Pointers - Tim Chaisson, Koady Chaisson and Jake Charron - have redefined the ever-evolving genre of modern folk with their third album Yours To Break released in 2019. With Billboard-worthy pop hooks, deep acoustic groove, trance-like trad breakdowns and three-part harmonies, the internationally acknowledged musical trailblazers have set a path for a new generation of music lovers.","url":"https://www.portfairyfolkfestival.com/the-east-pointers/","twitter":"","created_at":"2019-09-12T04:26:28.987Z","updated_at":"2020-01-06T04:08:59.002Z","image_file_name":"The_East_Pointers_2019_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":381662,"image_updated_at":"2020-01-06T04:08:58.561Z","artist_type":"musician","country":"CAN"},{"id":333,"name":"The Giant Seagulls","bio":"Totally surrealistic, with curious beaks, these giant seagulls will be rummaging in bags and pockets, stealing food from plates and picnic baskets, causing chaos as usual and squabbling amongst themselves. Shrieks of laughter follow them wherever they go. Watch your chips!","url":"https://www.portfairyfolkfestival.com/the-giant-seagulls/","twitter":"","created_at":"2020-01-06T02:01:01.126Z","updated_at":"2020-01-06T04:11:27.909Z","image_file_name":"Giant_Seagulls_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":294056,"image_updated_at":"2020-01-06T04:11:27.524Z","artist_type":"musician","country":"AUS"},{"id":294,"name":"The Jellyman's Daughter","bio":"Scottish duo The Jellyman's Daughter lands squarely in the middle of an intriguing crossroads between bluegrass, post-rock, folk and soul. Mixing their unique vocal harmonies with wild and visceral cello, driving guitar and sweet mandolin, Emily Kelly and Graham Coe write their songs together with a focus on doing something new. In 2018 The Jellyman’s Daughter released their new album, Dead Reckoning, representing a marked step forward in maturity, depth and scope for the duo, achieving five stars in multiple publications and inclusion in Popmatters’ the 20 Best Folk Albums of 2018. \r\n","url":"https://www.portfairyfolkfestival.com/the-jellymans-daughter/","twitter":"","created_at":"2019-09-12T04:37:08.168Z","updated_at":"2020-01-06T04:11:52.229Z","image_file_name":"The_Jellymans_Daughter_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":254016,"image_updated_at":"2020-01-06T04:11:51.881Z","artist_type":"musician","country":"SCO"},{"id":298,"name":"The Langan Band","bio":"Offering sounds emerging from Celtic, gypsy swing, Roma and flamenco, Britain’s The Langan Band are a high energy three piece act taking traditional acoustic idioms and delivering with punk abandonment and virtuosic flare.Lead by front man and percussionist John Langan, the group swerves between the fiddle and bass, the rhythm guitar, Cajon and tambourine in an eerie, psychedelic and mesmerising performance that challenges the limitations of what people might expect acoustic instruments to sound like.\r\n","url":"https://www.portfairyfolkfestival.com/the-langan-band/","twitter":"","created_at":"2019-09-12T04:41:01.244Z","updated_at":"2020-01-06T04:14:32.588Z","image_file_name":"Langan_Band_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":293514,"image_updated_at":"2020-01-06T04:14:32.236Z","artist_type":"musician","country":"SCO"},{"id":299,"name":"The Little Stevies","bio":"The Little Stevies have existed as a band for many years and have taken on many incarnations. At the heart of the band are sisters Bethany and Sibylla Stephen who have an uncanny knack of captivating an audience by being delightfully and unapologetically themselves. The Little Stevies are well known around the Australian festival circuit for their fun loving between-song banter and storytelling of everyday life. With a deep, full and warmly polished sound, sweet layered harmonies and irresistible melodies, the sisters’ music tends to leave a lasting impression.","url":"https://www.portfairyfolkfestival.com/the-little-stevies/","twitter":"","created_at":"2019-09-12T04:41:56.152Z","updated_at":"2020-01-06T04:14:54.437Z","image_file_name":"The_Little_Stevies_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":313768,"image_updated_at":"2020-01-06T04:14:53.681Z","artist_type":"musician","country":"AUS"},{"id":300,"name":"The Maes ","bio":"Multi-award-winning Melbourne contemporary folk outfit, The Maes is the brainchild of sisters Maggie and Elsie Rigby. Their latest, self-titled record released in 2019 is a return to the sisters’ folk music roots and follows on from the success of their Take Care Take Cover (2017) and live performances at festivals all over the world. Gentle, intimate and conversational, the new album is an unadorned showcase of Maggie and Elsie’s superb songwriting as well as honest, relaxed and stunning vocal and instrumental performances.  ","url":"https://www.portfairyfolkfestival.com/the-maes/","twitter":"","created_at":"2019-09-12T04:42:51.830Z","updated_at":"2020-01-06T04:15:12.559Z","image_file_name":"The_Maes_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":350783,"image_updated_at":"2020-01-06T04:15:12.187Z","artist_type":"musician","country":"AUS"},{"id":309,"name":"The Sandman \u0026 Flacco Tribute Show ","bio":"Sandman \u0026 Flacco: these two fictional characters passed away quietly, without fuss, ten years ago. Both were struck down with a deadly affliction known as “Irrelevance.”  \r\n In 2020 Steve “The Sandman” Abbott \u0026 Paul “Flacco” Livingston return to the stage for at least sixty minutes to present songs of The Sandman, soliloquies of suburban subsistence and monologues of morose musings. Hear Steve reading Sandman and Paul reading Flacco. Apart from exhuming their alter egos of the 80’s and 90’s, Paul and Steve will startle audiences with their sublimely adequate musical talents. This will be an hour you will never get back.  \r\nNote: Please be gentle with the performers – no one wants to die at their own funeral… \r\n","url":"https://www.portfairyfolkfestival.com/the-sandman-flacco-tribute-show/","twitter":"","created_at":"2019-09-12T04:50:38.954Z","updated_at":"2020-01-06T04:15:32.897Z","image_file_name":"Sandman___Flacco__1200x800.jpg","image_content_type":"image/jpeg","image_file_size":382602,"image_updated_at":"2020-01-06T04:15:32.483Z","artist_type":"musician","country":"AUS"},{"id":310,"name":"The Small Glories","bio":"Roots duo The Small Glories are Cara Luft \u0026 JD Edwards, a musical tour-de-force partnership planted on the Canadian Prairies. With a stage banter striking a unique balance between slapstick and sermon, these veteran singer/songwriters have a way of making time disappear. The Small Glories create a soundscape amplified by pounding drums and other textural embellishments which only reinforce the magic of their innate chemistry. Luft and Edwards duplicate and reinforce each other’s strengths on the stage which is made clear in their latest album Assiniboine \u0026 The Red, resulting in a live show that is as heartwarming as it is hilarious.","url":"https://www.portfairyfolkfestival.com/the-small-glories/","twitter":"","created_at":"2019-09-12T04:53:40.287Z","updated_at":"2020-01-06T04:15:51.681Z","image_file_name":"The_Small_Glories_2_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":394805,"image_updated_at":"2020-01-06T04:15:51.312Z","artist_type":"musician","country":"CAN"},{"id":311,"name":"The Southern Ocean Sea Band","bio":"The Southern Ocean Sea Band hail from Port Fairy town and have grown up with the Festival. The 9-piece line-up will take you on a journey into local stories and legends. \r\n The Southern Ocean Sea Band were borne directly from the late Danny Spooner’s Shanties at the River sessions, and a resultant flurry of writing and production activity towards their epic debut album Blood \u0026 Bones \u0026 Fins \u0026 Glory (2017). Following on from this epic release, the band have toured regional Victoria, spreading their historical songs and shanty love far and wide. They cite The Fairytale of Port Fairy event in 2018 as a career highlight, performing three songs and backing up Steve Poltz and Rebecca Barnard singing The Fairytale of New York. \r\n","url":"https://www.portfairyfolkfestival.com/the-southern-ocean-sea-band-2/","twitter":"","created_at":"2019-09-12T04:54:31.333Z","updated_at":"2020-01-06T04:16:15.551Z","image_file_name":"Southern_Ocean_Sea_Band_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":406000,"image_updated_at":"2020-01-06T04:16:14.936Z","artist_type":"musician","country":"AUS"},{"id":314,"name":"Things Of Stone \u0026 Wood","bio":"Thirty years ago a rag-tag bunch of folkies got together and formed a band called Things of Stone \u0026 Wood that went on to define Melbourne in the early 1990s. Off the back of their top 10 single Happy Birthday Helen, the band achieved national success, international tours, a gold album The Yearning and even a Late Show television parody, kicking off a career that would place them as one of Australia's most loved folk-rock bands. The group’s imaginative use of organic instruments set off an acoustic/folk movement that paved the way for the likes of John Butler, The Waifs and Angus \u0026 Julia Stone. Their live performances have always been full of energy and passion and whilst they've won many an industry award, it’s on stage that demonstrates why they're so loved. The band return to Port Fairy for their 30th anniversary tour launching their first album in over a decade.  \r\n","url":"https://www.portfairyfolkfestival.com/things-of-stone-wood/","twitter":"","created_at":"2019-09-12T04:56:52.011Z","updated_at":"2020-01-06T04:16:34.233Z","image_file_name":"Things_of_Stone___Wood_(TOSAW)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":392773,"image_updated_at":"2020-01-06T04:16:33.868Z","artist_type":"musician","country":"AUS"},{"id":315,"name":"This Way North","bio":"It’s easy to forget that This Way North is a two-piece band. With Cat Leahy on drums and Leisha Jungalwalla wailing on her electric guitar, the duo create a uniquely full, expansive sound that leaves the audience stunned. Currently of no fixed address, Cat and Leisha are enjoying making a home for themselves on the road and the stage. Whether in a local dive bar or at a national festival, This Way North bring more passion and energy than a 10-piece band, drumming up a contagious euphoria. The past two years have been huge for the duo, since they made the decision to concentrate on playing music full time they have added over 200 live shows across Australia, New Zealand and Canada to their ever-expanding resume. This Way North have brought their magic to audiences from the Yukon to Iqaluit, Nunavut to Haida Gwaii, across Australia's sweeping central desert and down to the geysers of Rotorua New Zealand.  This Way North invite you to turn up the volume and let loose. \r\n","url":"https://www.portfairyfolkfestival.com/this-way-north/","twitter":"","created_at":"2019-09-12T04:57:38.781Z","updated_at":"2020-01-06T04:16:51.502Z","image_file_name":"This_Way_North_K.Atkinson_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":191102,"image_updated_at":"2020-01-06T04:16:51.245Z","artist_type":"musician","country":"AUS"},{"id":351,"name":"Tina Green Circus","bio":"Emma Khourey aka ‘Tina Green’ is a wonderful and charming Street Theatre and Circus entertainer. A graduate of the New Zealand Physical Theatre and Circus School ‘Circo- Arts’, Emma specializes in Unicycle, Bowl Kicking and Hula Hoops. Watch Tina Green balance sky high on a unicycle kicking crockery up into the air and catching it on her head. Her action packed show features the most dangerous unicycle tricks possible, jula hooping a ring of fire whilst balancing on her bike and all with a smile on her face!","url":"https://www.portfairyfolkfestival.com/tina-green-circus-2/","twitter":"","created_at":"2020-01-06T02:07:21.867Z","updated_at":"2020-01-06T04:17:57.602Z","image_file_name":"Tina_Green_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":250962,"image_updated_at":"2020-01-06T04:17:57.310Z","artist_type":"kids","country":"AUS"},{"id":316,"name":"Tony McManus","bio":"Tony McManus is acknowledged as one of the leading Celtic guitarists in the world and has just been listed as one of the 50 transcendental guitarists of all time by Guitar Player Magazine. Ranked by peers and predecessors alike alongside the guitar world’s all-time greats, his fiendishly dexterous, dazzlingly original playing draws on traditions from the entire Celtic diaspora, along with still further-ranging flavours, such as jazz and east European music. Long applauded for his uncanny ability to transpose the delicate, complex ornamentation characteristic of traditional bagpipe or fiddle tunes – even the phrasing of a Gaelic song – onto his own six strings, McManus is increasingly being referenced as a pioneering figure in bridging the realms of Celtic music and other guitar genres. ","url":"https://www.portfairyfolkfestival.com/tony-mcmanus/","twitter":"","created_at":"2019-09-12T04:58:11.694Z","updated_at":"2020-01-06T04:18:17.357Z","image_file_name":"TonyMcManus3.1_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":260648,"image_updated_at":"2020-01-06T04:18:16.978Z","artist_type":"musician","country":"CAN"},{"id":390,"name":"True Spirit Revival Yoga","bio":"","url":"http://","twitter":"","created_at":"2020-01-16T01:30:46.976Z","updated_at":"2020-01-16T01:30:46.976Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":352,"name":"Ungus Ungus Ungus","bio":"Hold onto your hats as Ungus Ungus Ungus, Australia’s premier peddlers of vaudevillian psychedelia, strap you in for a rollercoaster ride of dance and mayhem. This is carnivalesque party music for the creatively inclined, traversing territory from global dance rhythms to swing, jazz, Balkan, and hip-hop. Featuring mind-tickling on-stage antics and a bold visual presence, their cosmic circus is on a mission to make you boogie, gawp and expand your perceptual horizons.","url":"https://www.portfairyfolkfestival.com/ungus-ungus-ungus/","twitter":"","created_at":"2020-01-06T02:07:38.466Z","updated_at":"2020-01-06T04:19:11.579Z","image_file_name":"Ungus_Ungus_Ungus_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":463361,"image_updated_at":"2020-01-06T04:19:10.631Z","artist_type":"musician","country":"AUS"},{"id":317,"name":"Uptown Brown","bio":"'Uptown' Brown! is a singing gentleman-adventurer performing a program of primitive 1920s and 1930s jazz and blues on a self-invented one man band. His musical contraption is built from cedar, leather and brass, whilst vocals and fingerpicked ukulele are amplified through old megaphones, mimicking the effect of a 78 record. A quality musical and roving act in the finest tradition of vaudeville and ragtime. ","url":"https://www.portfairyfolkfestival.com/uptown-brown-2/","twitter":"","created_at":"2019-09-12T04:58:44.968Z","updated_at":"2020-01-06T04:19:31.774Z","image_file_name":"Uptown_Brown_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":276772,"image_updated_at":"2020-01-06T04:19:31.471Z","artist_type":"musician","country":"AUS"},{"id":355,"name":"Warrnambool \u0026 District Pipes \u0026 Drums Inc","bio":"","url":"http://","twitter":"","created_at":"2020-01-07T06:01:58.510Z","updated_at":"2020-01-07T06:01:58.510Z","image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"artist_type":"musician","country":"AUS"},{"id":353,"name":"Wayne Jury \u0026 Justin Brady","bio":"Wayne Jury teams up with Justin Brady for a concert experience at Port Fairy, performing songs of life and love, songs of loss and gain. Together Justin \u0026 Wayne deliver a very dynamic show with Justin’s multi instrumental playing on the fiddle, harmonica and mandolin. The show is a powerful mixture of music as well as stories of life on the road and insights into their songs. For the first time, Justin \u0026 Wayne perform together at the 2020 Port Fairy Folk Festival. Here they will play as a duo, and Justin will also present his popular harmonica workshop.","url":"https://www.portfairyfolkfestival.com/wayne-jury-justin-brady/","twitter":"","created_at":"2020-01-06T02:07:58.189Z","updated_at":"2020-01-06T04:20:14.879Z","image_file_name":"Wayne_Justin_4_cr_cReza_Zamani_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":259396,"image_updated_at":"2020-01-06T04:20:14.486Z","artist_type":"musician","country":"AUS"},{"id":318,"name":"William Crighton","bio":"Combining traditional music with unexpected experimentation William Crighton is highly acclaimed across the globe from sell out tours and festival appearances in his homeland of Australia including Blues Fest, WOMAD and Woodford Folk Festival, to appearances at the Cambridge Folk Festival, Boomtown in the UK, and Tonder in Denmark, as well as sell out shows in the UK and Scandinavia and tours in the US and Canada. Crighton grew up in the Riverina, a sparsely populated region of NSW (Wiradjuri Nation) Australia. He has released two studio albums and one live album. He identifies powerful analogues of lived experience, through his visceral and poetic music with shades of psychedelia. His landmark second album Empire was hailed as The Album of the Year 2018 by The Saturday Paper.\r\n","url":"https://www.portfairyfolkfestival.com/william-crighton/","twitter":"","created_at":"2019-09-12T04:59:19.806Z","updated_at":"2020-01-06T04:20:30.297Z","image_file_name":"WILLIAM_CRIGHTON_2019_high_res_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":237571,"image_updated_at":"2020-01-06T04:20:29.912Z","artist_type":"musician","country":"AUS"},{"id":319,"name":"Will Kimbrough","bio":"Alabama native, Nashville resident Will Kimbrough is deeply rooted in the old school sounds of country, gospel, traditional blues, American folk and roots music.\r\nKimbrough last graced our shores playing guitar with Emmylou Harris’ Red Dirt touring band. The award-winning singer and songwriter was named as the Americana Music Association Instrumentalist of the Year in 2004, and this success is reflected by the demands on his time as a session player, record producer and touring musician.\r\nKimbrough’s latest record production credits are albums for Steve Poltz and Rodney Crowell. In 2019 Kimbrough released his ninth solo recording, I Like It Down Here and he will perform works from this album and across his career at the Port Fairy Folk Festival.\r\n","url":"https://www.portfairyfolkfestival.com/will-kimbrough/","twitter":"","created_at":"2019-09-12T05:00:02.640Z","updated_at":"2020-01-06T04:20:54.757Z","image_file_name":"Will_Kimbrough_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":414675,"image_updated_at":"2020-01-06T04:20:54.235Z","artist_type":"musician","country":"USA"},{"id":321,"name":"Ye Vagabonds","bio":"The brothers behind Ireland’s Ye Vagabond, Brían and Diarmuid Mac Gloinn grew up playing music together around their hometown of Carlow, a small town in the southeast of Ireland. After moving to Dublin in 2012, they quickly became a staple of the country’s live music and session scene, playing their own original songs as well as folk songs from Ireland, Scotland, England and America. After performing with Glen Harsard at Electric Picnic in 2015, the brothers continued to tour Ireland, the UK and Europe performing with Villagers, Roy Harper and Lisa Hannigan. They have performed sold out headline shows in Ireland, France, Switzerland and the UK. In 2017 they launched their debut, self-titled album to great acclaim comprising harmony and rich folk music, as well as influenced by Irish traditional music, Appalachian singing, and the 1960's folk revival. Ye Vagabonds second album The Hare’s Lament was released in 2019 to great acclaim.","url":"https://www.portfairyfolkfestival.com/ye-vagabonds/","twitter":"","created_at":"2019-09-12T05:01:43.592Z","updated_at":"2020-01-06T04:21:15.311Z","image_file_name":"Ye_Vagabonds_(preferred)_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":274417,"image_updated_at":"2020-01-06T04:21:14.536Z","artist_type":"musician","country":"IRL"},{"id":320,"name":"Yid!","bio":"YID! is a 22-piece ensemble performing European Jewish folk songs through a 21st century filter. Effortlessly amalgamating klezmer, funk, big band, indie-folk and electronic dance into a wild, immersive, theatrical experience, YID!’s charter is to reinvent the old and amazing culture and bring it into the here and now. YID!’s multi-sensory performance combines Yiddish language, group improvisation, song and poetry and with some of the most respected musicians in the Australian music scene making up the incredible ensemble, audiences are in for a zany fusion of Yiddish drinking songs and feisty free-jazz exclamations.","url":"https://www.portfairyfolkfestival.com/yid/","twitter":"","created_at":"2019-09-12T05:01:00.687Z","updated_at":"2020-01-06T04:21:46.470Z","image_file_name":"YID_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":560542,"image_updated_at":"2020-01-06T04:21:45.860Z","artist_type":"musician","country":"AUS"},{"id":322,"name":"YolanDa Brown","bio":"Charismatic and charming, YolanDa Brown is the premier female saxophonist in the UK. An award-winning saxophonist, Brown has made the instrument truly her own with her fusion of reggae, jazz and soul.Brown was the first musician to win a MOBO Award for Best Jazz across two consecutive years.Having toured with Diana Krall, The Temptations, Billy Ocean, Jools Holland’s Rhythm and Blues Orchestra and collaborated with artists such as Snarky Puppy’s Bill Laurance and Julian Marley, it’s no wonder Brown’s albums have received critical acclaim, with both hitting no.1 spot on the UK charts. Outside of touring and recording, Brown presents YolandDa’s Band Jam a music show for children’s television. \r\n","url":"https://www.portfairyfolkfestival.com/yolanda-brown-2/","twitter":"","created_at":"2019-09-12T05:02:46.838Z","updated_at":"2020-01-06T04:22:07.639Z","image_file_name":"YolanDa_Brown_Photo_by_Agenda_1200x800.jpg","image_content_type":"image/jpeg","image_file_size":204183,"image_updated_at":"2020-01-06T04:22:07.259Z","artist_type":"musician","country":"UK"}],"venues":[{"id":105,"name":"Blarney Books \u0026 Art","locationx":null,"locationy":null,"created_at":"2020-01-06T05:55:21.525Z","updated_at":"2020-01-06T06:04:05.647Z","gig_id":null,"order":15},{"id":90,"name":"Circus - ‘Thookay’ ","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:21.436Z","updated_at":"2020-01-06T05:55:42.967Z","gig_id":null,"order":9},{"id":106,"name":"Community Centre","locationx":null,"locationy":null,"created_at":"2020-01-06T05:56:22.764Z","updated_at":"2020-01-06T06:04:17.209Z","gig_id":null,"order":16},{"id":84,"name":"Fiddlers Green","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.975Z","updated_at":"2020-01-06T06:01:28.518Z","gig_id":null,"order":10},{"id":88,"name":"Flag Circle - ‘Kurween'","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.949Z","updated_at":"2020-01-06T06:00:59.211Z","gig_id":null,"order":8},{"id":78,"name":"Island Stage  -  ‘Maleen’","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.514Z","updated_at":"2020-01-06T06:04:35.737Z","gig_id":null,"order":4},{"id":93,"name":"Lecture Hall","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:22.165Z","updated_at":"2020-01-06T06:01:37.587Z","gig_id":null,"order":11},{"id":98,"name":"Lighthouse Stage - ‘Wurpta'","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:23.380Z","updated_at":"2020-01-06T06:04:49.803Z","gig_id":null,"order":5},{"id":79,"name":"Ocean Stage - ‘Mirteetch'","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.757Z","updated_at":"2020-01-06T06:04:56.755Z","gig_id":null,"order":2},{"id":76,"name":"Pyipgil Gunditj","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.024Z","updated_at":"2020-01-06T05:46:23.293Z","gig_id":null,"order":1},{"id":86,"name":"Reardon Theatre","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.462Z","updated_at":"2020-01-06T06:05:08.697Z","gig_id":null,"order":13},{"id":77,"name":"River Stage  - ‘Warinoong’","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:18.270Z","updated_at":"2020-01-06T06:05:15.088Z","gig_id":null,"order":3},{"id":94,"name":"St John's Church","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:22.408Z","updated_at":"2020-01-06T06:02:19.682Z","gig_id":null,"order":14},{"id":107,"name":"St Pat's Church","locationx":null,"locationy":null,"created_at":"2020-01-06T05:56:36.674Z","updated_at":"2020-01-06T06:03:36.647Z","gig_id":null,"order":18},{"id":87,"name":"St Pat's Hall","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:20.706Z","updated_at":"2020-01-06T06:01:53.293Z","gig_id":null,"order":12},{"id":83,"name":"The Pavilion - 'Marrarr Woorn'","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:19.731Z","updated_at":"2020-01-06T06:00:48.676Z","gig_id":null,"order":7},{"id":101,"name":"The Shebeen - 'Kirnaa'","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:24.110Z","updated_at":"2020-01-06T05:50:29.700Z","gig_id":null,"order":6},{"id":102,"name":"The Wharf","locationx":null,"locationy":null,"created_at":"2016-02-29T00:35:24.353Z","updated_at":"2020-01-06T06:05:47.092Z","gig_id":null,"order":17},{"id":108,"name":"Uniting Church","locationx":null,"locationy":null,"created_at":"2020-01-06T05:57:27.115Z","updated_at":"2020-01-06T06:03:48.975Z","gig_id":null,"order":19}],"gigs":[{"id":446,"name":"","starttime":"2020-03-07T08:00:00.000Z","endtime":"2020-03-07T09:30:00.000Z","created_at":"2020-01-16T01:32:05.276Z","updated_at":"2020-01-16T01:32:05.276Z","venue_id":87,"gig_type":"music"},{"id":450,"name":"","starttime":"2020-03-07T13:45:00.000Z","endtime":"2020-03-07T15:15:00.000Z","created_at":"2020-01-16T01:36:12.467Z","updated_at":"2020-01-16T01:36:12.467Z","venue_id":87,"gig_type":"workshop"},{"id":444,"name":"","starttime":"2020-03-07T20:45:00.000Z","endtime":"2020-03-07T21:45:00.000Z","created_at":"2020-01-16T01:29:05.563Z","updated_at":"2020-01-16T01:29:05.563Z","venue_id":93,"gig_type":"music"},{"id":447,"name":"","starttime":"2020-03-07T10:00:00.000Z","endtime":"2020-03-07T11:30:00.000Z","created_at":"2020-01-16T01:32:45.452Z","updated_at":"2020-01-16T01:32:45.452Z","venue_id":87,"gig_type":"workshop"},{"id":424,"name":"ABC Live Broadcast","starttime":"2020-03-07T10:00:00.000Z","endtime":"2020-03-07T12:00:00.000Z","created_at":"2020-01-14T06:02:32.470Z","updated_at":"2020-01-14T06:02:32.470Z","venue_id":86,"gig_type":"music"},{"id":423,"name":"Alana Wilkinson","starttime":"2020-03-06T20:00:00.000Z","endtime":"2020-03-06T20:45:00.000Z","created_at":"2020-01-14T05:58:35.072Z","updated_at":"2020-01-16T00:00:30.867Z","venue_id":93,"gig_type":"music"},{"id":437,"name":"Aloha Baby","starttime":"2020-03-07T18:30:00.000Z","endtime":"2020-03-07T19:45:00.000Z","created_at":"2020-01-16T00:01:54.539Z","updated_at":"2020-01-16T00:01:54.539Z","venue_id":84,"gig_type":"music"},{"id":422,"name":"Archie Roach","starttime":"2020-03-08T14:00:00.000Z","endtime":"2020-03-08T15:00:00.000Z","created_at":"2020-01-14T05:57:16.508Z","updated_at":"2020-01-15T23:59:52.739Z","venue_id":77,"gig_type":"music"},{"id":419,"name":"Archie Roach CD Launch","starttime":"2020-03-06T20:45:00.000Z","endtime":"2020-03-06T22:00:00.000Z","created_at":"2020-01-14T05:50:26.220Z","updated_at":"2020-01-14T05:57:33.430Z","venue_id":77,"gig_type":"music"},{"id":430,"name":"Banjo Paterson Show","starttime":"2020-03-07T10:00:00.000Z","endtime":"2020-03-07T11:00:00.000Z","created_at":"2020-01-14T06:13:11.827Z","updated_at":"2020-01-14T06:16:24.265Z","venue_id":84,"gig_type":"kids_show"},{"id":435,"name":"Chitra","starttime":"2020-03-07T17:00:00.000Z","endtime":"2020-03-07T18:00:00.000Z","created_at":"2020-01-15T23:54:53.968Z","updated_at":"2020-01-15T23:54:53.968Z","venue_id":84,"gig_type":"music"},{"id":433,"name":"Claymore","starttime":"2020-03-07T15:15:00.000Z","endtime":"2020-03-07T16:15:00.000Z","created_at":"2020-01-15T23:52:29.851Z","updated_at":"2020-01-15T23:52:29.851Z","venue_id":84,"gig_type":"music"},{"id":429,"name":"Claymore","starttime":"2020-03-06T21:30:00.000Z","endtime":"2020-03-06T22:30:00.000Z","created_at":"2020-01-14T06:11:40.275Z","updated_at":"2020-01-14T06:11:40.275Z","venue_id":86,"gig_type":"music"},{"id":448,"name":"Cool Out Sun ","starttime":"2020-03-07T12:00:00.000Z","endtime":"2020-03-07T13:15:00.000Z","created_at":"2020-01-16T01:33:26.619Z","updated_at":"2020-01-16T01:33:26.619Z","venue_id":87,"gig_type":"workshop"},{"id":441,"name":"Daniel Champagne","starttime":"2020-03-07T16:30:00.000Z","endtime":"2020-03-07T17:30:00.000Z","created_at":"2020-01-16T00:09:58.029Z","updated_at":"2020-01-16T00:09:58.029Z","venue_id":93,"gig_type":"music"},{"id":438,"name":"Festival Choir Workshop","starttime":"2020-03-07T10:30:00.000Z","endtime":"2020-03-07T12:00:00.000Z","created_at":"2020-01-16T00:03:13.587Z","updated_at":"2020-01-16T00:03:13.587Z","venue_id":93,"gig_type":"workshop"},{"id":421,"name":"First Nations in Song","starttime":"2020-03-07T13:30:00.000Z","endtime":"2020-03-07T15:00:00.000Z","created_at":"2020-01-14T05:55:48.180Z","updated_at":"2020-01-14T06:16:40.732Z","venue_id":76,"gig_type":"theme_concert"},{"id":431,"name":"Flats \u0026 Sharps","starttime":"2020-03-07T12:45:00.000Z","endtime":"2020-03-07T13:45:00.000Z","created_at":"2020-01-14T06:14:09.788Z","updated_at":"2020-01-14T06:14:09.788Z","venue_id":84,"gig_type":"music"},{"id":436,"name":"Heidi Hoops","starttime":"2020-03-07T18:00:00.000Z","endtime":"2020-03-07T18:30:00.000Z","created_at":"2020-01-15T23:56:24.980Z","updated_at":"2020-01-16T00:00:06.930Z","venue_id":84,"gig_type":"kids_show"},{"id":449,"name":"Irish Set Dancing","starttime":"2020-03-07T13:45:00.000Z","endtime":"2020-03-07T15:15:00.000Z","created_at":"2020-01-16T01:34:55.520Z","updated_at":"2020-01-16T01:37:22.467Z","venue_id":87,"gig_type":"workshop"},{"id":434,"name":"Irish Set Dancing Showcase","starttime":"2020-03-07T16:30:00.000Z","endtime":"2020-03-07T16:45:00.000Z","created_at":"2020-01-15T23:53:45.975Z","updated_at":"2020-01-15T23:53:45.975Z","venue_id":84,"gig_type":"dance_friendly"},{"id":425,"name":"Parade to Gates","starttime":"2020-03-06T17:30:00.000Z","endtime":"2020-03-06T18:00:00.000Z","created_at":"2020-01-14T06:06:11.927Z","updated_at":"2020-01-14T06:06:30.273Z","venue_id":84,"gig_type":"music"},{"id":427,"name":"Paul McKenna Band","starttime":"2020-03-06T21:15:00.000Z","endtime":"2020-03-06T22:15:00.000Z","created_at":"2020-01-14T06:08:32.681Z","updated_at":"2020-01-14T06:08:32.681Z","venue_id":93,"gig_type":"music"},{"id":443,"name":"Sketching Workshop","starttime":"2020-03-07T18:00:00.000Z","endtime":"2020-03-07T18:45:00.000Z","created_at":"2020-01-16T01:26:48.451Z","updated_at":"2020-01-16T01:26:48.451Z","venue_id":93,"gig_type":"workshop"},{"id":440,"name":"Songwriters Forum","starttime":"2020-03-07T14:30:00.000Z","endtime":"2020-03-07T16:00:00.000Z","created_at":"2020-01-16T00:09:03.325Z","updated_at":"2020-01-16T00:09:03.325Z","venue_id":93,"gig_type":"workshop"},{"id":426,"name":"Southern Ocean Sea Band","starttime":"2020-03-06T18:00:00.000Z","endtime":"2020-03-06T19:00:00.000Z","created_at":"2020-01-14T06:07:26.492Z","updated_at":"2020-01-14T06:07:26.492Z","venue_id":84,"gig_type":"music"},{"id":432,"name":"Sport Suzie","starttime":"2020-03-07T14:15:00.000Z","endtime":"2020-03-07T14:45:00.000Z","created_at":"2020-01-14T06:15:48.089Z","updated_at":"2020-01-14T06:15:48.089Z","venue_id":84,"gig_type":"kids_show"},{"id":442,"name":"The Maes","starttime":"2020-03-07T18:00:00.000Z","endtime":"2020-03-07T18:45:00.000Z","created_at":"2020-01-16T00:17:37.197Z","updated_at":"2020-01-16T00:17:37.197Z","venue_id":93,"gig_type":"music"},{"id":439,"name":"Ukulele Workshop","starttime":"2020-03-07T12:30:00.000Z","endtime":"2020-03-07T14:00:00.000Z","created_at":"2020-01-16T00:07:26.976Z","updated_at":"2020-01-16T00:07:26.976Z","venue_id":93,"gig_type":"music"}]}
